[
  {
    "name": "Mr. Jeff Pottinger",
    "title": "Co-Founder",
    "company": "ReLAUNCH Advisors",
    "bio": "I’ve dedicated my career to helping individuals and organizations unlock potential, improve engagement, and achieve meaningful results. With 24 years in the Navy Supply Corps and another 24 years in the commercial sector, I bring firsthand experience navigating the complexities of career transitions and building thriving teams.\r\n\r\nWhether you’re moving into a new professional chapter or striving to create a more engaged and aligned workforce, I provide the tools and strategies to make it happen.\r\n\r\nAs a certified WHY.os Activator and Gallup-certified Strengths Coach, I specialize in career transition and employee engagement.\r\n\r\nFor individuals, I help uncover your WHY, identify your Strengths, and craft personal brand narratives that open doors to new opportunities.\r\n\r\nFor organizations, I deliver transformative workshops that align employees’ WHY and Strengths with organizational goals, creating a culture of purpose, engagement, and high performance.\r\n\r\nOne of the most rewarding parts of my work is seeing individuals and teams step into their potential. As one client said:\r\n\r\n“Jeff’s ability to combine WHY and Strengths into actionable strategies completely changed the way I approach my career. I walked away with clarity, confidence, and a renewed sense of purpose.”\r\n\r\nWHAT I Offer\r\nI help professionals and organizations gain clarity and build confidence in sharing the unique value they bring to the world. My approach is personalized, practical, and rooted in uncovering what drives you or your team—and how to use that knowledge to achieve your goals.\r\n\r\nHOW I Can Help:\r\n1:1 Coaching Sessions – Discover your WHY, identify your Strengths, and craft a personal brand narrative you can use across your LinkedIn profile, resume, interviews, and networking.\r\n\r\nEmployee Engagement Workshops – Inspire employee engagement and align individual WHY and Strengths with organizational goals.\r\n\r\nCareer Transition Seminars – Work closely with veterans and professionals to provide tailored strategies for navigating your next career move.\r\n\r\nWHY We Should Work Together\r\nAre you ready to uncover your WHY, harness your Strengths, and build a career narrative or organizational culture that reflects the real you?\r\n\r\nLet’s connect and explore how I can help you or your team achieve your goals. Reach out to me today at jeff.pottinger@relaunchadvisors.com!"
  },
  {
    "name": "Mr. Matt Stevens",
    "title": "Chief Executive Officer",
    "company": "The Honor Foundation",
    "bio": "Matt Stevens is the Chief Executive Officer of The Honor Foundation (THF) and a member of its board of directors. Previously, Matt served as a Navy SEAL for 26 years, where he led high-performing teams conducting our nation’s most sensitive operations, cultivated interagency relationships, and executed operations in the most dynamic environments. Immediately following his Navy career, Matt served on the leadership team of an emerging technology firm.\r\n\r\nMatt graduated from the U.S. Naval Academy with a B.S. in Ocean Engineering and completed Basic Underwater Demolition/SEAL (BUD/S) training with class 179. He commanded at every level in the Naval Special Warfare Community, including a Squadron at Naval Special Warfare Development Group, SEAL Team TWO, Naval Special Warfare Unit THREE, and Naval Special Warfare Group FOUR.\r\n\r\nHe also served in staff roles at the Joint Special Operations Command in Fort Bragg, NC; as the Operations Officer at Naval Special Warfare Group TWO in Virginia Beach, VA; and in the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (ASD SO/LIC) in the Pentagon.\r\n\r\nMatt is a graduate of THF’s program and remains deeply passionate about serving others and advocating for veterans’ issues. In his free time, he enjoys exploring the great outdoors."
  },
  {
    "name": "Mr. William \"Bill\" Innes",
    "title": "Deputy Director, Acquisition, SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": "Mr. Innes entered civil service upon graduation from St. Louis University in 1993 and subsequent positions in industry. His initial government assignment in 1997 was to the San Antonio Air Logistics Center, Kelly AFB, TX, providing engineering support to the propulsion directorate and later the C-17 program on-site at Charleston AFB, SC. Following a short period at Warner-Robins ALC, Mr. Innes was assigned to the Aeronautical Systems Center, Wright-Patterson Air Force Base, Ohio supporting the F-22 program as Chief Sustainment Engineer. This led to his selection as the CV-22 Chief Engineer at Patuxent River NAS. Mr. Innes then broadened his DoD organizational and technical knowledge base as Senior Defense Analyst in the Office of the Secretary of Defense, AT&L (Industrial Policy). In 2009, Mr. Innes volunteered for a 12-month assignment to Kabul, Afghanistan supporting Operation Enduring Freedom where he supported the US Army and US Agency for International Development as a Program Manager for large infrastructure projects throughout the country. Upon completion of the assignment, Mr. Innes returned to the Air Force and the CV-22 program, taking on the role of Deputy Program Manager. In 2012 he was assigned to USTRANSCOM as Division Chief for a portfolio of Information Technology programs. He was promoted to SES and assigned as Deputy Director, Acquisition for USSOCOM in May 2019."
  },
  {
    "name": "Ms. Meaghan Keeler",
    "title": "Chief Operating Officer",
    "company": "Global SOF Foundation",
    "bio": "Ms. Meaghan Keeler is the founding Chief Operating Officer of the Global SOF Foundation and an International Security Fellow at New America. She is responsible for the Foundation’s operations, financial stewardship, and program delivery. Prior to her position with the Foundation, Ms. Keeler worked for CACI supporting Operational Planning Teams at U.S. Special Operations Command. In this capacity, Ms. Keeler managed a team of analysts, subject matter experts, writers, research associates, and strategic communicators. Previously, she worked in the Commander’s Action Group and Operations Directorate at U.S. Central Command, supporting the 4-star commander. Ms. Keeler was also the Interim Executive Director and Events Coordinator for Women In International Security, a non-profit professional membership organization for women who work in international affairs.\r\n\r\nShe holds master’s and bachelor’s degrees from Georgetown University’s Walsh School of Foreign Service. She lives in St. Petersburg, FL."
  },
  {
    "name": "Ms. Leslie Babich",
    "title": "Director",
    "company": "SOFWERX",
    "bio": "Leslie Babich joined the DEFENSEWERX team to lead SOFWERX in Tampa, FL in October 2020. As the Director of SOFWERX, Leslie provides operational and personnel oversight while developing and implementing business plans that optimize results for its government partner, the United States Special Operations Command (USSOCOM).\r\n\r\nLeslie brings 20+ years of special operations experience where she served as an MC-130E/H Pilot in Air Force Special Operations Command and held various leadership positions to include squadron command, Director of the Commander’s Action Group at Headquarters, Air Force Special Operations Command, and Commander, Joint Special Operations Air Component - Central. She also served as the Fixed-Wing Assessment Director and Chief of Program Analysis and Evaluation at the United States Special Operations Command in the Force Structure, Requirements, Resources and Strategic Assessment Directorate. During her service, she deployed multiple times in support of Operations Enduring Freedom, Enduring Freedom-Philippines, Iraqi Freedom, and Inherent Resolve. Prior to joining SOFWERX, Leslie was employed as a Business Unit Manager with Jabil Defense and Aerospace in Saint Petersburg, FL.\r\n\r\nLeslie received her Bachelor of Science in Management from the Air Force Academy, her Master of Arts in Counseling and Leadership from the University of Colorado, and her Master of Science in International Strategic Studies from the Air War College at Maxwell AFB."
  },
  {
    "name": "Mr. Glen Cullen",
    "title": "Program Manager, SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Travis Owens",
    "title": "Chief, Visual Multimedia Support Division",
    "company": "U.S. Special Operations Command",
    "bio": "Travis Owens serves as the Chief, Visual Multimedia Support Division, United States Special Operations Command, MacDill AFB, FL. His office provides internal visual information product support to the United States Special Operations Command Headquarters (USSOCOM HQ) and the SOF enterprise.\r\n\r\nHe enlisted in the United States Army in 2002 and was assigned to the 4th Psychological Operations Group (4th POG), Ft. Bragg, NC. As a Multimedia Illustrator (25M) and paratrooper in 3rd Battalion Bravo Company, he created radio, video, and print products for use in tactical Psychological Operations (PSYOP). He then deployed to Afghanistan in support of Operation Enduring Freedom, attached to 3rd Special Forces Group, conducting PSYOP product development and dissemination.\r\n\r\nIn 2006, after his time in the military, Mr. Owens began his career as a government civilian at the United States Special Operations Command (USSOCOM) Headquarters, MacDill AFB, FL. He is a plank holder with the Joint Psychological Operations Support Element (JPSE), Product Development Branch (PDB), where he served as an Audio-Visual Specialist creating strategic PSYOP video products. This organization was later renamed the Joint Military Information Support Command (JMISC) and subsequently relocated to Ft. Bragg, NC. Mr. Owens was then transferred to the Visual Information Center (VIC), later renamed the Visual Multimedia Support Division (VMSD) within USSOCOM HQ, and tasked with creating internal video products in support of the Commander’s priorities. In 2019, he assumed his current position as Chief of the VMSD (GS-13 1084).\r\n\r\nMr. Owens earned his Bachelor of Fine Arts degree in Broadcast Design from the Savannah College of Art and Design, graduating in 2000. He later acquired a Master of Strategic Intelligence from the National Intelligence University in 2018. His thesis, entitled \"Visual Information Support to J2 Intelligence Products within USSOCOM Headquarters,\" analyzed and compared how the United States Special Operations Command and United States Central Command utilize Visual Information in their intelligence products. Mr. Owens has been awarded and recognized multiple times for his outstanding ability to produce unparalleled video, graphic design, and print products."
  },
  {
    "name": "Mr. Jeffrey Young",
    "title": "Solution Consulting Manager",
    "company": "Adobe",
    "bio": "Jeffrey Young is a Solution Consultant Manager for Adobe Public Sector.  During his 15 years at Adobe, Jeffrey specializes in content velocity, storytelling, content security, video production, and content authenticity. Prior to Adobe, Jeffrey produced interactive video narratives for the IC and DoJ. He is better known as soldier 258 in Spielberg’s War of the Worlds and father of eight."
  },
  {
    "name": "Mr. Kenneth Raimondi",
    "title": "Solution Consulting",
    "company": "Adobe",
    "bio": "Ken Raimondi is a creative professional with more than 20 years of experience. His work spans short films, web content, and radio and TV production, both in the U.S. and internationally. Ken received an Emmy nomination for the docuseries \"Basic: Journey to Airman,\" which he worked on with the Air Force in Texas. As a military veteran and former public sector employee, Ken excels at finding solutions to the unique challenges faced by public sector teams. He currently resides in San Antonio, Texas."
  },
  {
    "name": "Ms. Lisa R. Sanders",
    "title": "Director, Science and Technology Directorate",
    "company": "U.S. Special Operations Command",
    "bio": "Ms. Lisa R. Sanders is the Director of Science and Technology for Special Operations Forces, Acquisition, Technology & Logistics (SOF AT&L), U.S. Special Operations Command (USSOCOM), MacDill Air Force Base, Florida. She is responsible for all research and development funded activities and has over 30 years of civilian federal service.\r\n\r\nMs. Sanders began her federal career as an Electronics Engineer at the Naval Avionics Center in Indianapolis, Indiana, where she served in quality engineering, production engineering, and program management roles. In 1996, she transferred to the Naval Air Warfare Center and Naval Air Systems Command (NAVAIR) at Patuxent River, Maryland, serving as an Electronics Engineer and Program Manager for the E-2C Hawkeye aircraft.\r\n\r\nIn 2003, she assumed responsibility for the production and modification of the CV-22 Osprey. During her time at NAVAIR, she managed one of the first Multi-Year Procurements and executed the modification and delivery of CV-22 production and developmental test aircraft.\r\n\r\nMs. Sanders transferred to USSOCOM in 2005, where she continued overseeing CV-22 production and served as the Systems Acquisition Manager for the C-130 program in the Program Executive Office Fixed Wing, managing all C-130 projects across the SOF inventory.\r\n\r\nIn 2010, she was promoted to Deputy Director for the Science and Technology Directorate, and in 2011, she assumed the role of Director of Science & Technology.\r\n\r\nIn 2014, Ms. Sanders left USSOCOM to attend the Defense Acquisition University Senior Service College Fellowship in Aberdeen, Maryland. Upon graduating in 2015, she was assigned to Headquarters, Air Force, where she served as Chair of the Air Force Capability Development Working Group. In 2016, she was selected as a Defense Intelligence Senior Leader.\r\n\r\nMs. Sanders has two children and two grandchildren.\r\n\r\nEducation:\r\n\r\nGMI Engineering & Management Institute, Flint, MI — Bachelor of Science, Mechanical Engineering, 1987\r\n\r\nSt. Leo University, St. Leo, FL — Master’s, Business Administration, 2010\r\n\r\nSenior Service College Fellowship, Aberdeen, MD — Senior Professional Military Education, 2015"
  },
  {
    "name": "Ms. Robin Burke",
    "title": "SBIR/STTR Program Manager",
    "company": "U.S. Special Operations Command",
    "bio": "Ms. Robin Burke is the USSOCOM SBIR/STTR Program Manager. She supported the Defense Industry for over 25 years of her career. Prior to taking her current role as a Government Civilian, she worked for startup, small, and large Defense contracting companies supporting a variety of services, hardware/software, and manufacturing programs for Naval Special Warfare (NSW), Marine Corps Intelligence (MC INTEL), Navy Shipboard, and Navy Nuclear Shipbuilding. Her expertise includes Program Management, Project Management, Systems Engineering, Contracts, and Business Development. Robin holds a Bachelor of Science Degree from the Mercer University School of Engineering in Technical Communication."
  },
  {
    "name": "Mr. Brian Shipley",
    "title": "Director",
    "company": "Department of Navy SBIR/STTR Programs",
    "bio": "Brian Shipley is the director for the Department of the Navy (DoN) Small Business Innovation Research (SBIR) / Small Business Technology Transfer (STTR) Programs. In this role he oversees implementation of the programs to stimulate technological innovations, use small business to meet Federal research and development needs, increase private sector commercialization of Federally funding research and development, and foster and encourage minority and disadvantaged participation in technological innovation.\r\n\r\nMr. Shipley has over 30 years of experience working with DoN and DoD programs. He began his career in financial management providing programming and planning for DoN shipbuilding and research and development programs. In 2007, he joined the DoD Office of Small Business Programs to provide overarching program management support to the DoD SBIR/STTR Programs. In 2013, Mr. Shipley transitioned to the DoN SBIR/STTR Programs Office to support policy development, program management and outreach and joined the civilian workforce in July 2020 as the DoN SBIR/STTR Commercialization Program Manager. He has been in his current role as Acting Director since May 2024.\r\n\r\nMr. Shipley earned a bachelor’s in marketing and management from the University of Maryland and a Master of Business Administration from Johns Hopkins University."
  },
  {
    "name": "Mr. Daniel Carroll",
    "title": "Director",
    "company": "AFVentures",
    "bio": "Daniel leads the management and execution for the $1.5 Billion US Air Force and Space Force Small Business Innovation Research and Small Business Technology Transfer (SBIR/STTR) programs. Previously, Daniel was the Chief Engineer at USAF Kessel Run, the Technical Director at the US Special Operations Command Program Executive Office Fixed Wing aircraft, and the Autonomous Vehicles Lead Engineer for Space and Naval Warfare Systems Center.  Daniel earned an MSx in Management from the Stanford Graduate School of Business through the USAF Civilian Development program and a BS/MSE in Electrical and Computer Engineering from the Johns Hopkins University."
  },
  {
    "name": "Mr. Zeke Topolosky",
    "title": "Program Manager",
    "company": "Army SBIR Programs",
    "bio": ""
  },
  {
    "name": "Ms. Melissa Johnson",
    "title": "Acquisition Executive",
    "company": "U.S. Special Operations Command",
    "bio": "Melissa A. Johnson, a member of the Senior Executive Service, is the Acquisition Executive, U.S. Special Operations Command, MacDill Air Force Base, Florida. Ms. Johnson serves as the principal advisor to the Commander, United States Special Operations Command for Special Operations Research and Development, test, production, fielding, and sustainment of SOF-peculiar programs across aviation, space, cyber, maritime, ground, weapons, and communication systems.\r\n\r\nMs. Johnson graduated from the University of Florida in 1995 and received her commission from the United States Air Force Officer Training School in March 1996. Throughout her 24 years on active duty, Ms. Johnson served in a variety of assignments and leadership roles ranging from Program Manager for a highly classified strategic combat system directed by the Deputy Secretary of Defense, to other significant leadership roles such the Director for non-standard Aircraft Systems and Materiel Leader for Strategic Combat Systems, Air Force Rapid Capabilities Office. For her final assignment, she served as the Program Executive Officer for Fixed Wing Programs, Headquarters U.S. Special Operations Command.\r\n\r\nPrior to her position as the Acquisition Executive, Ms. Johnson served as the Deputy Director and Acting Director for the Department of the Air Force’s Rapid Capabilities Office. She oversaw selected study, development, and fielding activities tasked directly by the Under Secretary of Defense for Acquisition and Sustainment, Under Secretary of Defense for Research and Engineering, the Secretary of the Air Force, Air Force Chief of Staff, the Chief of Space Operations, the Assistant Secretary for the Air Force for Acquisition, Technology and Logistics, and the Assistant Secretary of the Air Force for Space Acquisition and Integration. She delivered capabilities at the speed of emerging threats for combat Air and Space Forces and Combatant Command requirements, leveraging streamlined acquisition methods to developing, acquiring, and fielding of critical capabilities. Current programs under the purview of the organization include the X-37B Orbital Test Vehicle, a reusable, unmanned space test platform for the U.S. Space Force, and the B-21 Raider, a long-range strike bomber for the U.S. Air Force."
  },
  {
    "name": "Colonel Clarence E. Burton, Jr.",
    "title": "Director of Procurement",
    "company": "U.S. Special Operations Command",
    "bio": "Colonel Burton is the Director of Procurement for the United States Special Operations Command. His role is to rapidly deploy contracting expertise resulting in superior technologies, equipment, and services for Special Operations Forces. \r\n\r\nColonel Burton entered the Air Force in 2003 through the Reserve Officer Training Corps at The Citadel, Charleston, S.C. He is a joint qualified officer and has served as a two-time squadron commander, and a contracting officer for the Warner Robins Air Logistics Complex and Special Operations Command Europe. His career also includes a broadening assignment as a Program Element Monitor in the Office of the Assistant Secretary of the Air Force for Acquisition, Technology, and Logistics’ Global Power Programs Directorate.  In this role, Colonel Burton directed acquisition planning, programming, budgeting, and execution for the $13 billion F-15C, F-15E, and F-15EX investment portfolios.  In 2007, Colonel Burton deployed to Kabul, Afghanistan as a Contingency Contracting Officer in support of OPERATION ENDURING FREEDOM.\r\n\r\nPrior to his current assignment, Colonel Burton was a military student assigned to the Dwight D. Eisenhower School for National Security and Resource Strategy at the National Defense University in Washington D.C."
  },
  {
    "name": "Ms. Ashley Farrier",
    "title": "Director of Small Business Programs",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. John Burnham",
    "title": "CAPTAIN, USN (Ret.); Former Deputy Assistant Secretary of Defense",
    "company": "Global SOF Advisory Board",
    "bio": "John Burnham serves as Mission Command Integration lead for the Defense & Intel portfolio of Accenture Federal Services, serving clients across the DoD and Intelligence Communities.\r\n\r\nBefore joining Accenture in 2017 he was a naval officer serving in Naval Special Warfare for 28 years and deploying around the world in tactical, operational and command levels. After retiring from active duty in 2014 he was appointed Deputy Assistant Secretary of Defense and served for three years in the Obama administration. His military assignments include deployments as a Surface Warfare Officer onboard USS MARVIN SHIELDS (FF-1066); tactical and senior operational leadership tours at SEAL Team TWO, Naval Special Warfare Development Group, and Joint Special Operations Command (JSOC); command of SEAL Team FOUR; numerous deployments in command of Joint Special Operations Task Forces in Afghanistan, Iraq, and other locations; and command of JSOC’s Joint Interagency Task Force.\r\n\r\nMr. Burnham is a graduate of the University of Pennsylvania, holds an MBA from the College of William & Mary and is a Distinguished Graduate of the National War College. He and his family live in Arlington, Virginia."
  },
  {
    "name": "Mayor Jane Castor",
    "title": "Mayor",
    "company": "City of Tampa",
    "bio": ""
  },
  {
    "name": "Mr. Stu Bradin",
    "title": "President & CEO",
    "company": "Global SOF Foundation",
    "bio": "COL (Ret.) Stu Bradin is the President and CEO of the Global SOF Foundation. He retired as a U.S. Army Special Forces colonel in May 2014 after over 32 years of service. Stu’s Special Forces assignments include service with elements of Joint Special Operations Command, as Deputy Director of Operations at Special Operations Command Europe, and extensive service with the 7th and 10th Special Forces Groups (Airborne). He commanded several SFODAs (“A-Teams”) and served as a battalion Operations Officer as well as the Company Commander of the counter terrorist unit designated as the CINC’s In Extremist Force. He participated in Operation Just Cause, served tours as an adviser in El Salvador and Peru, and is a veteran of multiple unconventional and other special operations with 10th SFG(A) in the Balkans and numerous locations in northern and central Africa.\r\n\r\nIn 2007, Stu was tasked with establishing the NATO Special Operations Coordination Center (NSCC), and on 1 March 2010 the NSCC was designated as the NATO Special Operations Headquarters, where Stu served as the Chief of Staff until June 2011. In 2011 he was in Afghanistan as the Director of the Special Operations Fusion Cell – a multinational Joint Interagency Task Force with 19 nations and 8 agencies supporting NATO SOF. Stu’s final assignment was Chief of the Expanding Global SOF Network Operational Planning Team tasked with making U.S. Special Operations Command a global combatant command.\r\n\r\nStu was a Latin American Foreign Area Officer and received a master’s degree in Latin American Studies from San Diego State University. He attended the School of Americas Command and Staff Course and was assigned to the School of Advanced Military Studies as one of the authors of the first version of FM 3.0, the Army’s Operations manual. Stu taught at the Command and General Staff College as a SOF Instructor with a mission to form the Special Operations Program. He lives in Lithia, FL with his wife, Kelly, and three daughters."
  },
  {
    "name": "The Honorable Pete Hegseth",
    "title": "Secretary of Defense",
    "company": "U.S. Department of Defense",
    "bio": "The Honorable Pete Hegseth is the 29th Secretary of Defense, sworn in on Jan. 25, 2025.\r\n\r\nHegseth was commissioned as an infantry officer in the U.S. Army National Guard after graduating from Princeton University in 2003. He participated in a number of active-duty deployments during his time in service, including operations in Guantanamo Bay, Iraq and Afghanistan. Hegseth also served in multiple staff positions in the National Guard.\r\n\r\nHegseth's military awards include two Bronze Star Medals, the Joint Commendation Medal, two Army Commendation Medals, the Combat Infantryman Badge (CIB) and the Expert Infantryman Badge (EIB). He has authored five books, including the New York Times best-seller The War on Warriors (2024)."
  },
  {
    "name": "General Bryan P. Fenton",
    "title": "Commander",
    "company": "U.S. Special Operations Command",
    "bio": "General Bryan P. Fenton is a career Special Forces (Green Beret) Officer. He currently serves as the 13th Commander of the U.S. Special Operations Command (USSOCOM), located at MacDill Air Force Base, FL. He oversees all Special Operations for the U.S. Department of Defense with 70,000 Army, Navy, Air Force, and Marine Special Operations personnel and an annual budget of $14 billion.\r\n\r\nBefore assuming command of USSOCOM, General Fenton served as the Commander of Joint Special Operations Command (JSOC), headquartered at Fort Liberty, NC. Prior to that, he was the Senior Military Assistant for two U.S. Secretaries of Defense.\r\n\r\nGeneral Fenton’s other general officer assignments include: Deputy Commander of U.S. Indo-Pacific Command; Commander of U.S. Special Operations – Pacific; and Deputy Commanding General of the U.S. Army’s 25th Infantry Division in Hawaii.\r\n\r\nHe has commanded at all levels and his Joint and Special Operations assignments include: Director of Operations (J3) at the Joint Special Operations Command; Brigade, Battalion, and Squadron Commands; multiple overseas Task Force Commands; Detachment Commander and Operations Officer in 1st Battalion, 7th Special Forces Group (Airborne); as well as Infantry Rifle Platoon Leader and Executive Officer in Bravo Company, 4th Battalion, 502 Infantry Regiment (Berlin).\r\n\r\nGeneral Fenton deployed multiple times, participating in Operation Joint Forge (Bosnia); Operation Enduring Freedom (Afghanistan/Africa); Operations Iraqi Freedom and Inherent Resolve (Iraq); and Operation Pacific Eagle (Philippines). He has served in multiple Areas of Responsibility including U.S. Southern Command; U.S. European Command; U.S. Africa Command; U.S. Central Command; and U.S. Indo-Pacific Command.\r\n\r\nHis U.S. military training includes: the U.S. Army Infantry Officer Basic and Advanced Courses; the U.S. Army Special Forces Qualification Course; U.S. Army Ranger School; Special Forces Language Training (Spanish); Special Forces Military Free Fall (MFF); along with French Commando Training and the Ecuadorian Jungle Training Course.\r\n\r\nGeneral Fenton’s awards include: the French Commando Badge; the Cruz de la Victoria Medal from Chile; Princess of Thailand awarded Thai Jumpmaster Wings; the University of Notre Dame’s Moose Krause Service Award and its Rev. William Corby Award for Distinguished Military Service; and the Business Executives for National Security (BENS) Eisenhower Award."
  },
  {
    "name": "Command Sergeant Major Shane Shorter",
    "title": "Senior Enlisted Leader",
    "company": "U.S. Special Operations Command",
    "bio": "Command Sergeant Major Shorter enlisted in the Army in 1988 and attended Infantry Basic Training and Advanced Individual Training at Fort Benning, GA. He was subsequently assigned to 3rd Infantry Division in Kitzingen, Germany.\r\n\r\nCommand Sergeant Major Shorter volunteered for Special Forces training and graduated the Special Forces Qualification Course in 1992. He was then assigned to 3rd Battalion, 1st Special Forces Group (A) at Fort Lewis Washington. During the following 23 years, he has held the positions of Junior Medical NCO, Senior Medical NCO, Team Sergeant and HSC First Sergeant. His Sergeant Major assignments with 1st Special Forces Group include: OPSDET Sergeant Major, Company Sergeant Major for Charlie Company 3rd Battalion, Group Operations Sergeant Major, 1st Battalion Command Sergeant Major and Group Command Sergeant Major. Command Sergeant Major Shorter’s nominative positions include the Command Senior Enlisted Leader of Special Operations Command Pacific, United States Indo-Pacific Command, and Joint Special Operations University (JSOU).\r\n\r\nCommand Sergeant Major Shorter’s military education includes every level of Non- Commissioned Officer Professional Development, to include the Summit Course. He is a graduate of the Special Forces Qualification Course, Special Forces Operations and Intelligence Course, Static Line Jumpmaster Course, Dive Medical Technician’s Course and the Military Free Fall Parachutist Course.\r\n\r\nCommand Sergeant Major Shorter’s awards and decorations include the Defense Superior Service Medal, Bronze Star Medal, Meritorious Service Medal, Army Commendation Medal with “V” device, and Army Achievement Medal. He has been awarded the Special Forces Tab, Combat Infantryman’s Badge, Expert Infantryman’s Badge, Expert Field Medic Badge, Master Parachutist Badge, Military Free Fall Parachutist Badge, and the Saint Phillip of Neri Award (Bronze Order).\r\n\r\nCommand Sergeant Major Shorter and his wife Leslie have been married 33 years and have one daughter, Kelcie, 28, who is a speech language pathologist and resides in Washington."
  },
  {
    "name": "Ms. Sarah P. Roder, CFEI",
    "title": "Director of Partnerships and Member Engagement",
    "company": "AAFMAA",
    "bio": "Sarah Roder is the Director of Partnerships and Member Engagement at AAFMAA. She previously served as a Relationship Manager for AAFMAA Wealth Management and Trust, Senior Veterans Affairs Coordinator, the SpouseLink Ambassador for the Camp Lejeune area, and a member of the Member Benefits Team.\r\n\r\nSarah holds the Certified Financial Education Instructor® designation, having completed the National Financial Educators Council Program. As a military spouse and mother, she enjoys spending time outdoors and helping others. She is a proud graduate of Auburn University."
  },
  {
    "name": "Sergeant Major Gregory Keller",
    "title": "POTFF Senior Enlisted Leader",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Kelly Ammerman",
    "title": "Director, U.S. Special Operations Command",
    "company": "Warrior Care Program (Care Coalition)",
    "bio": "Mr. H. Kelly Ammerman was born in Honolulu, Hawaii and raised in upstate New York.    Mr. Ammerman previously served in the U.S. Army and retired in November of 2017 with over 27 years of military service, 23 of which were spent in the Special Operations community as a Special Forces Non-Commissioned Officer. \r\n\r\nMr. Ammerman entered the U.S. Army in February of 1990. He completed basic training at Fort Jackson, South Carolina.  His military service included deployments from Operation Desert Shield/Storm to multiple tours in support of Operation Enduring Freedom and Theater Security Cooperation Plans.  He served in numerous positions, to include Special Forces Operational Detachment-Alpha (SFODA) Medical NCOIC, Assault Stack Leader, Company Assault Sergeant, SFODA Team Sergeant, Special Forces Group Current Operations NCOIC, First Sergeant, Senior Military Science Instructor, and culminated in his role as the Senior Enlisted Advisor for the USSOCOM Warrior Care Program (Care Coalition).  He assumed the role of Deputy in 2017 and has served as the Director since December 2020. \r\n\r\nHis significant military education includes:  Military Legal Specialist Course; Basic Airborne Course; Air Assault Course; Special Forces Qualification Course; Special Operations Target Interdiction Course (SOTIC); Jumpmaster Course; Special Forces Advanced Reconnaissance, Target Analysis and Exploitation Techniques Course (SFARTAETC); Survival, Evasion, Resistance and Escape (SERE) Level-C; Primary Leadership Development Course (PLDC); Basic Non-Commissioned Officer Course (BNCOC); Advanced Non-Commissioned Officer Course (ANCOC); First Sergeants Course; and the U.S. Army Sergeant Majors Academy (USASMA). \r\n\r\nMr. Ammerman is married, has two sons, and is a proud grandfather of two."
  },
  {
    "name": "Mr. Arthur Coon",
    "title": "Director of Enterprise Information Systems",
    "company": "SOF AT&L, U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Liliana Roman",
    "title": "Deputy Director, Enterprise Information Systems (EIS), SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": "Ms. Liliana Roman, currently serving as the Deputy Director for Enterprise Information Systems (EIS) at the U.S. Special Operations Command (USSOCOM), brings a rich blend of expertise and leadership to her role. Appointed in May 2023, she oversees the development of fieldable prototypes and manages the acquisition and sustainment of SOF Garrison C4 Systems and Military Information Support Systems at MacDill Air Force Base in Florida. Her current position involves the oversight of seven key acquisition programs, with a substantial annual budget exceeding $618 million.\r\n\r\nMs. Roman's career in federal service spans over 24 years, dedicating a significant portion of it to the Department of Defense. Her journey at USSOCOM is marked by 21 years of diverse experiences, where she notably contributed as Program Manager for Enterprise Networks and Acquisition Program Manager (APM) across various departments. Her roles included managing the Civil Information Management Data Processing System/Media Production Center (MPC) Enterprise, overseeing the Next Generation Infrastructure (NGI), and leading the C4IAS program.\r\n\r\nBefore her tenure at USSOCOM, Ms. Roman served in the United States Army as a 25B, where she honed her skills and knowledge in information systems. Complementing her extensive professional experience, she holds a Bachelor of Science degree in Management Information Systems from the University of Tampa. This academic background, combined with her practical experience, positions her as a leader adept at navigating the complex landscape of information systems within the defense sector."
  },
  {
    "name": "Mr. Peter Bergen",
    "title": "Vice President Global Studies & Fellows, New America; Professor, Arizona State University;",
    "company": "CNN National Security Analyst; Chairman of the Board, Global SOF Foundation",
    "bio": "Peter Bergen is a journalist, documentary producer, vice president at New America, CNN national security analyst, professor of practice at Arizona State University, and the author or editor of ten books, three of which were New York Times bestsellers and four of which were named among the best non-fiction books of the year by the Washington Post. The books have been translated into twenty-four languages, and documentaries based on them have been nominated for two Emmys and won the Emmy for best documentary.\r\n\r\nBergen also serves as New America’s Director of the International Security and Future of War programs. He writes a weekly column for CNN.com. He is a member of the Homeland Security Experts Group and a fellow at Fordham University’s Center on National Security. Bergen is on the editorial board of Studies in Conflict & Terrorism, a leading scholarly journal. He has held teaching positions at the Kennedy School of Government at Harvard University and the School of Advanced International Studies at Johns Hopkins University. For many years he was a fellow at New York University’s Center on Law and Security. He has testified before US Congressional committees eighteen times about national security issues.\r\n\r\nIn 2011 he published The Longest War: The Enduring Conflict between America and Al-Qaeda. The book won the Washington Institute’s Gold Prize for the best book on the Middle East. In 2012 he published Manhunt: The Ten-Year Search for Bin Laden, from 9/11 to Abbottabad. It won the Overseas Press Club award for the best book on international affairs. HBO based the film “Manhunt” on the book, which won the 2013 Emmy for best documentary. In 2013 he published Talibanistan: Negotiating the Borders Between Terror, Politics, and Religion, a collection of essays about the Taliban that Bergen co-edited. In 2014 he published Drone Wars, a collection of essays about drone warfare that Bergen co-edited. In 2016, he published United States of Jihad: Investigating America’s Homegrown Terrorists, and HBO adapted the book for the film “Homegrown: The Counter-Terror Dilemma.” In 2021 he published The Rise and Fall of Osama bin Laden and, in 2022, The Cost of Chaos: The Trump Administration and the World.\r\n\r\nBergen has a degree in Modern History from New College, Oxford. He is married to the documentary director/producer Tresha Mabile. They have two children."
  },
  {
    "name": "Lieutenant General Richard E. Angle",
    "title": "Commander",
    "company": "Allied SOF Command",
    "bio": "Lieutenant General Richard E. Angle was born in Orange, California. He was commissioned from the United States Military Academy at West Point as an infantry officer in 1991.\r\n\r\nPrior to his current assignment, Lt. Gen. Angle served as the Special Assistant to the Director of the Army Staff, Office of the Chief of Staff of the Army.\r\n\r\nWhile serving with the 1st Battalion, 4th Infantry Regiment at the Joint Multi-national Readiness Center in Hohenfels, Germany, his assignments included rifle platoon leader, scout platoon leader, and scout platoon observer controller.\r\n\r\nAfter graduating from the Infantry Officer Advanced Course and the Special Forces Qualification Course, Lt. Gen. Angle was assigned to 2nd Battalion, 10th Special Forces Group (Airborne), where he commanded a Special Forces Operational Detachment and served as the battalion assistant operations officer. He later commanded 1st Battalion, 1st Special Forces Group (Airborne), in Okinawa, Japan.\r\n\r\nLt. Gen. Angle graduated from the U.S. Army Command and General Staff College and was assigned to the United States Army Office of Military Support in Washington, D.C. While assigned to this unit, he served as a troop commander, squadron operations officer, unit operations officer, squadron commander, and unit commander.\r\n\r\nHis other assignments include tours as military assistant to the Secretary of the Army; as Chief of Staff, U.S. Army Special Operations Command; Deputy Commanding General, 1st Special Forces Command; Deputy Commanding General-Operations, Army Cyber Command; Deputy Commanding General for Joint Special Operations Command, and most recently as the Commanding General, 1st Special Forces Command (Airborne).\r\n\r\nHe has participated in contingency and combat operations in Bosnia, Kosovo, Afghanistan, Pakistan, Iraq, the Horn of Africa, and the Philippines.\r\n\r\nLt. Gen. Angle has earned a bachelor’s degree in economics from West Point and a master’s in business administration from Webster University. He is a distinguished graduate of the National Defense University’s Eisenhower School, earning a master’s degree in Resource Strategy.\r\n\r\nHe and his wife Jennifer are proud parents of two children, Ryan and Lauren and a dog, Sage."
  },
  {
    "name": "General (Ret.) Laura J. Richardson",
    "title": "Co-Chair",
    "company": "U.S. Global Leadership Coalition National Security Advisory Council",
    "bio": "General (retired) Laura J. Richardson recently completed her tour as the 32nd Commander of United States Southern Command. She is a native of Northglenn, Colorado and a graduate of Metropolitan State University of Denver. She commissioned into the U.S. Army and trained as an Army Aviator. She holds a Master of Science in National Resource Strategy from the National Defense University.\r\n\r\nOver her 38 year career, General(R) Richardson has commanded from the Company to Combatant Command level. Prior to taking command of USSOUTHCOM, she served as the Commanding General of U.S. Army North (Fifth Army) which is the Army Service Component Command for U.S. Northern Command. She commanded an Assault Helicopter Battalion in combat in the 101st Airborne Division (Air Assault) 2003 04, in support of Operation Iraqi Freedom and deployed to Afghanistan as the Deputy Chief of Staff for Communications Headquarters International Security Assistance Force in support of Operation Enduring Freedom. She has also served in numerous staff assignments at a myriad of locations, including Military Aide to the Vice President at the White House in Washington, D.C., the Army’s Legislative Liaison to Congress at the U.S. Capitol, and at the Pentagon as the Army Transformation Director."
  },
  {
    "name": "Lieutenant General Joshua M Rudd",
    "title": "Deputy Commander",
    "company": "U.S. Indo-Pacific Command",
    "bio": "A native of Southern California, Lt. Gen.  Joshua M. Rudd grew up in South Carolina and graduated from Furman University in 1993 after earning his commission through the Reserve Officers’ Training Corps program. Entering active duty as a Quartermaster Officer, he successfully completed Special Forces Assessment and Selection in 1996.\r\n\r\nAs a Special Forces Officer, he has commanded at every echelon from Operational Detachment Alpha to Group. He has served in numerous flag and command assignments, to include: Deputy Commanding General – Operations of the 25th Infantry Division (2019-2020), Deputy Commanding General of the 1st Special Forces Command (Airborne) (2018-2019), Commander JIATF-NCR (2017-2018), Commander of a Forward Deployed Combined Joint Special Operations Task Force (2017-2018), Commander of 3rd Operations Support Group (2015-2017), and Commander of a Forward Deployed Combined Joint Task Force (2015-2017). He served as Commander, Special Operations Command Pacific where he oversaw Special Operation Forces across 52 percent of the globe, while providing operational oversight for the planning and execution of sustained special operations to ensure a free and secure Indo-Pacific.  He most recently served as Chief of Staff, United States Indo-Pacific Command.\r\n\r\nHe deployed in support of multiple combat operations including Operation Enduring Freedom, Operation Iraqi Freedom, Operation New Dawn and Operation Inherent Resolve.\r\n\r\nHis professional education includes U.S. Army War College – Fellowship at Duke University, Naval Command and Staff College, Infantry Officer Advanced Course and Quartermaster Officer Basic Course. Additionally, he holds a master's degree in Strategy and National Security from the Naval War College and a bachelor's degree in Political Science from Furman University. He is authorized to wear the following awards and decorations: Defense Superior Service Medal (three awards), Legion of Merit (three awards), Bronze Star Medal (three awards), Combat Infantryman Badge, Special Forces Tab, Ranger Tab, Military Free Fall Jumpmaster Badge and Combat Diver Supervisor Badge.\r\n\r\nLt. Gen. Rudd assumed duties as Deputy Commander, United States Indo-Pacific Command, on Sept. 25, 2024."
  },
  {
    "name": "Gen. Stephen N. Whiting",
    "title": "Commander",
    "company": "U.S. Space Command",
    "bio": "Gen. Stephen N. Whiting is the Commander, U.S. Space Command, headquartered at Peterson Space Force Base, Colo.\r\n\r\nAs Commander, Gen. Whiting is responsible for defending U.S. and allied interests in the space domain while providing space-enabled combat effects to joint warfighters around the globe. He exercises combatant command authority over Soldiers, Marines, Sailors, Airmen and Guardians operating ground and space-based systems around the world.\r\n\r\nGen. Whiting is a 1989 distinguished graduate of the U.S. Air Force Academy with a degree in aeronautical engineering. He is a space operations officer and has commanded the 13th Space Warning Squadron; the 614th Air and Space Operations Center and Joint Space Operations Center; the 21st Space Wing; and the Combined Force Space Component Command and 14th Air Force.\r\n\r\nGen. Whiting’s staff assignments include positions at Headquarters U.S. Air Force; U.S. Space Command; U.S. Strategic Command; the Chief of Naval Operations’ Strategic Studies Group; the Office of the Deputy Secretary of Defense; Headquarters Air Force Space Command; and Headquarters U.S. Space Force.\r\n\r\nPrior to his current position, the general was Commander, Space Operations Command, Peterson SFB, Colorado."
  },
  {
    "name": "Dr. Keenan Yoho",
    "title": "Vice President and Board Member",
    "company": "Global SOF Foundation",
    "bio": "Dr. Keenan Yoho has spent more than a decade working with senior management leading change in both commercial and public sector environments. Dr. Yoho’s research and applied work is focused on supply chain cost modeling and operations management to achieve enterprise-wide outcomes under conditions of uncertainty and resource scarcity.\r\n\r\nDr. Yoho served as Senior Special Advisor to U.S. Special Operations Command (USSOCOM) from 2012 to 2014. During this time Dr. Yoho worked with a special team reporting directly to the Commander, USSOCOM that was charged with crafting and executing a plan for posturing special operations forces (SOF) for the next three decades. Dr. Yoho has advised several U.S. and international organizations to include IBM (semiconductors), General Motors (autos), General Mills (foods), Intel (semiconductors), Rockwell Automation (machine automation), BASF (chemicals –Germany, US and Mexico), Merck, KGaA (chemicals – Germany), Ryerson (steel processing & distribution), Qualcomm (designer/supplier telecommunications technology), and Polioles SA de CV (chemicals – Mexico), the U.S. Army, U.S. Air Force, and U.S. Transportation Command in the areas of operations management, supply chain management, continuous improvement and organizational transformation.\r\n\r\nPrior to joining the Crummer Graduate School of Business at Rollins College, Dr. Yoho was an associate operations researcher at the RAND Corporation in Santa Monica, California where he led projects to improve the operational effectiveness of the U.S. military during war. Dr. Yoho was recently an assistant professor at the Naval Postgraduate School in Monterey, California where he received 4 consecutive teaching awards including the School’s highest award for excellence in teaching and impact beyond the classroom.\r\n\r\nDr. Yoho has published in the International Journal of Production Economics, International Journal of Operations and Quantitative Management, Journal of Cost Analysis and Parametrics, International Journal of Physical Distribution & Logistics Management, and the Journal of Operations and Supply Chain Management. Dr. Yoho holds a Ph.D. in Operations Management, M.B.A. in Operations Management, and M.S. in Industrial Relations from the University of Wisconsin-Madison. He also holds a B.A. in Religion with a concentration in Chinese and Japanese Buddhism from Temple University."
  },
  {
    "name": "Ms. Emily Harding",
    "title": "Director of Intelligence, National Security Program; Vice President, Defense & Security Department",
    "company": "Center for Strategic and International Studies",
    "bio": "Emily Harding is Director of the Intelligence, National Security, and Technology (INT) Program and Vice President of the Defense and Security Department at CSIS. As the head of the INT Program, she provides thought leadership on the most critical issues facing intelligence professionals and on the future of intelligence work. She also serves as deputy director of the International Security Program, where she is responsible for leading a team of world-renowned scholars providing policy solutions that shape national security. Drawing on her decades of experience in national security, Emily has established herself as an expert on how technology is revolutionizing national security work. Harding has served in a series of high-profile national security positions at critical moments. While serving as deputy staff director on the Senate Select Committee on Intelligence, she led the committee’s investigation into Russian interference in the 2016 elections, which was lauded for its bipartisanship. At CIA, she led analysts and analytic programs through moments of crisis, including shepherding the Iraq Group during the attempted Islamic State takeover. During a tour at the National Security Council, she served as director for Iran. After leaving the White House, her team ran the first Office of the Director of National Intelligence-led presidential transition, where she was responsible for briefing the incoming administration. Harding is an adjunct lecturer at the Johns Hopkins School of Advanced International Studies. Her analysis has appeared in the Wall Street Journal, BBC, NPR, Bloomberg, and other outlets. Harding holds a master’s degree from Harvard University’s Kennedy School of Government and a bachelor’s degree from the University of Virginia."
  },
  {
    "name": "Ms. Clementine G. Starling-Daniels",
    "title": "Director",
    "company": "Forward Defense Program, Atlantic Council",
    "bio": "Clementine G. Starling-Daniels is the director of the Atlantic Council’s Forward Defense program and a resident fellow within the Scowcroft Center for Strategy and Security. In her role, she shapes the Center’s U.S. defense research agenda, leads Forward Defense’s team of nine staff and forty fellows, and produces thought leadership on U.S. security strategies and the evolving character of warfare. Her research focuses on long-term U.S. thinking on issues like China’s and Russia’s defense strategies, space security, the defense industry, and emerging technology.\r\n\r\nPrior to launching the Forward Defense program at the Atlantic Council, Starling-Daniels served as the deputy director of the Atlantic Council’s Transatlantic Security team, specializing in European security policy and NATO. From 2016, she supported NATO’s Public Diplomacy Division at two NATO summits (Brussels and London) and organized and managed three senior Atlantic Council Task Forces on U.S. force posture in Europe, military mobility, and U.S. defense innovation adoption.\r\n\r\nDuring her time at the Atlantic Council, Starling-Daniels has written numerous reports and commentary on U.S. space strategy, deterrence, operational concepts, coalition warfare, and U.S.-Europe relations. Starling-Daniels regularly serves as a panelist and moderator at public conferences, and her analysis and commentary have been featured in Defense One, Defense News, Real Clear Defense, the National Interest, Space News, NATO’s Joint Air & Space Power Conference, the BBC, National Public Radio, ABC News, and Government Matters, among others.\r\n\r\nStarling-Daniels was named the 2022 Herbert Roback scholar by the U.S. National Academy of Public Administration. She also served as the 2020 Security and Defense fellow at Young Professionals in Foreign Policy.\r\n\r\nOriginally from the United Kingdom, Starling-Daniels previously worked in the UK Parliament focusing on technology, defense, Middle East security, and Ukraine. She also supported the Britain Stronger in Europe campaign, championing for the United Kingdom to remain within the European Union.\r\n\r\nShe graduated with honors from the London School of Economics with a Bachelor of Science in international relations and history, and she received her Master of Arts in Security Studies from Georgetown University’s School of Foreign Service."
  },
  {
    "name": "Colonel Jesse Marsalis",
    "title": "Program Executive Officer, PEO SOF Support Activity (SOFSA)",
    "company": "U.S. Special Operations Command",
    "bio": "Colonel Jesse R. Marsalis, a native of Natchitoches, LA, enlisted in the Army as a Combat Engineer in 1990. He was commissioned through the U.S. Army Officer Candidate School (OCS) in 1999 and entered the Army’s Acquisition Corps in 2009. COL Marsalis has over thirty-four years of experience in acquisition, combat, and operational assignments. His recent roles include serving as the Program Executive Officer for Special Operations Forces Support Activities at USSOCOM, Executive Officer for the U.S. Government’s COVID-19 vaccine operation (Operation Warp Speed), and Program Manager Special Programs at PEO Special Operations Warrior, USSOCOM. He also served as Legislative Liaison at the Office of the Chief, Legislative Liaison, and as a Defense Fellow to Senator Susan M. Collins (R-ME).\r\n\r\nHis military leadership roles include Chief Program Integrator for the Combat Development Directorate at USASOC, Assistant Program Manager for Fire Support at USSOCOM, Commander of Alpha Company, 1st Special Troops Battalion, 101st Airborne Division, and Brigade Engineer for the 101st Airborne Division during Operation Iraqi Freedom. COL Marsalis has held numerous NCO and enlisted positions, including Squad Leader, Battalion Reconnaissance NCO, Team Leader, and Demolition Specialist in the 8th Engineer Battalion, 1st Cavalry Division, Fort Hood, TX.\r\n\r\nCOL Marsalis holds a bachelor’s degree in Industrial Engineering from the University of Southern Mississippi and several master’s degrees, including Engineering Management from the University of Missouri, Business Administration from Vanderbilt University, Legislative Affairs from George Washington University, and National Resource Strategy from the Dwight D. Eisenhower School for National Security and Resource Strategy.\r\n\r\nHis awards and decorations include the Bronze Star Medal, Defense Meritorious Service Medal, Meritorious Service Medal, Army Commendation Medal, Army Achievement Medals, Combat Action Badge, Parachutist Badge, Air Assault Badge, Ranger Tab, Army Staff Identification Badge, and the Bronze de Fleury Medal.\r\n\r\nCOL Marsalis is married to Cherilynne Whitney Marsalis and they have eight children: Jonathan (23), Elise (22), Riley (20), Mitchell (17), Lillian (14), Benjamin (12), Asher (10), and Nora Jane (7)."
  },
  {
    "name": "Mr. Joel J. Fox",
    "title": "Special Operations Forces Support Activity Program Manager - Expeditionary Support",
    "company": "U.S. Special Operations Command",
    "bio": "Mr. Joel J. Fox leads a diverse team of six government employees and contractor support personnel. PM-ES provides logistics-related capability development, enhancement, and support programs that deliver operational capabilities, programmatic expertise, and acquisition authority in support of Special Operations Forces.\r\n\r\nPM-ES is responsible to the PEO for managing the Joint Operational Stock Program; Foreign/Non-Standard Weapons, Materiel, and Munitions Program; Mobile Technology and Repair Complex Program; and providing contested logistics support to USSOCOM subordinate units and directorates.\r\n\r\nPrior to assuming his role as the PM for Expeditionary Support, Mr. Fox was the SOF Systems Branch Chief, managing contract support for four SOCOM components, eight PEOs/directorates, five Theater Special Operations Commands (TSOCs), the National Mission Forces, other high-priority units, and other government activities."
  },
  {
    "name": "Mr. Kareem Sykes",
    "title": "Industry & Engagement Program Manager",
    "company": "Project Spectrum",
    "bio": "Mr. Sykes currently provides Industry & Engagement support for Project Spectrum, a U.S. Department of Defense (DoD) recognized cybersecurity awareness initiative that offers resources, training, and tools toward increasing cybersecurity awareness and hygiene for small businesses in particular. Mr. Sykes provides strategic leadership for a dynamic team of cybersecurity and outreach professionals whose collective aim centers around providing the educational resources and tools small businesses and institutions need to develop, implement, and maintain cybersecurity compliance. He oversees and directs the daily execution of multiple projects within the large-scale program and assures that the initiative adheres to government regulatory guidance. Mr. Sykes also manages contractual requirements to assure that Project Spectrum meets the cost, schedule, and performance goals set by the DoD Office of Small Business Programs (OSBP).\r\n\r\nPrior to joining Project Spectrum, Mr. Sykes served as a dynamic and ITIL v4-certified Program Manager. He amassed more than 15 years of organizational thought leadership experience and leveraged proven Program and Project Management principles, rooted in the Project Management Body of Knowledge (PMBOK®) methodology. Mr. Sykes is particularly adept at implementing enhanced business processes that result in an economy of scale. He is a proven rapport and relationship cultivator who focuses on the three Cs: Customer Service, Collaboration, and Communication. Mr. Sykes has a hallmark for motivating, mentoring, and coaching high-performance teams that deliver scalable results that drive productivity.\r\n\r\nMr. Sykes has a strong track record of successful matrix management of large teams (100+ FTEs), primes, subcontractors, and third-party vendors. He has managed various personnel levels, including Project Managers, Business Process Engineers, IAT II & III Cyber Systems Analysts, Network Engineers, DevOps, Application Support Specialists, Help Desk Technicians (Tier 1–3), Information Assurance Managers, Quality Managers, Sr. Business Analysts, Project Administrators, Training Analysts, and Supervisors.\r\n\r\nMr. Sykes obtained his Bachelor’s degree from the University of Baltimore, having studied Jurisprudence-Pre Law, and holds an A.A. degree in Interdisciplinary Studies as well."
  },
  {
    "name": "Ms. Juliet Funt",
    "title": "Founder and CEO",
    "company": "Juliet Funt Group",
    "bio": "Featured in top media outlets such as Forbes, CNBC, and Fast Company, Juliet Funt is a globally renowned keynote speaker, tough-love advisor to the Fortune 500, founder and CEO of the efficiency training firm, Juliet Funt Group.\r\n\r\nJuliet is the author of A Minute to Think, nominated for the Next Big Idea Club curated by Malcolm Gladwell, Dan Pink, Susan Cain and Adam Grant. She is an evangelist for freeing the potential of companies by unburdening their talent from busywork, and she has brought her powerful concepts to Spotify, National Geographic, Anthem, Vans, Abbott, Costco, Pepsi, Nike, Wells Fargo, Sephora, Sysco, and ESPN."
  },
  {
    "name": "Lieutenant General (Ret.) Giovanni Tuck",
    "title": "Former Director of Logistics (J4)",
    "company": "The Joint Staff",
    "bio": "Giovanni Tuck, a retired Air Force Lieutenant General, serves as the Chief Executive Officer at Robbins Gioia, LLC. Prior to joining Robbins Gioia, Lieutenant General Tuck served as the former Director of Logistics (J4), The Joint Staff, a former member of the Army Senior Executive Service as the Deputy Director, Supply, Production and Distribution, Federal COVID - 19 Response, and the Vice President for Global Military and Government Sales, CAE Healthcare, Inc. At CAE Healthcare, Inc. Lieutenant General Tuck led the organization's national and international military and government sales efforts to deliver worldwide safety and training environments from CAE’s vast array of innovative modeling, simulation and education product and services. As Acting Chief Operating Officer, he oversaw all manufacturing and logistics operations to include engineering, supply chain management, production and distribution, and information technology. \r\n\r\nLieutenant General Tuck is a 33-year U.S. Air Force veteran and has a record of exceptional results in demanding, high-pressure environments. He is uniquely skilled in directing global operations, developing strategic plans, improving organizational cultures, and implementing vision, to lead the Joint Force to innovative outcomes. Lieutenant General Tuck possesses extensive experience in developing logistics, transportation, distribution, and supply chain strategies as well as executing strategic planning for major defense programs in partnership with our Allies. He has a proven ability to cultivate high-performing teams and foster collaboration among stakeholders to achieve strategic objectives. \r\n\r\nLieutenant General Tuck holds master’s degrees from Webster University, the Naval War College,  and the National War College and a Bachelor of Science Degree from Texas State University. He  has completed course work at Harvard University and George Washington University. Lieutenant  General Tuck serves as a Senior Advisory Board member to the Veterans Administration on the  GI Bill, and Warrior Rising, a nonprofit helping Veterans succeed in business."
  },
  {
    "name": "Lieutenant General Dimitri Henry",
    "title": "Director for Intelligence",
    "company": "The Joint Staff, U.S. Marine Corps",
    "bio": "Lieutenant General Dimitri Henry assumed duties as Director for Intelligence, Joint Staff (J2), June 1, 2022. Lt. Gen. Henry enlisted in the Marine Corps in 1981 and attained the rank of Staff Sgt. After completion of the Broadened Opportunity for Officer Selection Training (BOOST) he was selected for the Marine Enlisted Commissioning Education Program (MECEP) and graduated from Texas A&M University in 1988, and was commissioned a 2nd Lt. from May 1990-May 1993, 2nd Lt. Henry served at 2nd Radio Battalion and deployed with 8th Marines (DESERT SHIELD/DESERT STORM), 26th MEU SOC (PROVIDE PROMISE), and was OIC of the II MEF Communications Center. In June 1993, 1st Lt. Henry attended Naval Postgraduate School, graduating with a Master of Science degree in Systems Engineering.\r\n\r\nIn 1995, Capt. Henry was subsequently assigned to the Navy Information Warfare Activity at the National Security Agency. In December 1997, he reported to 15th MEU SOC serving as S2A and then S2. After two MEU SOC deployments Maj. Henry reported to Marine Corps Command and Staff College in August 2000.\r\n\r\nFrom 2001-2004, Maj. Henry served as the Commanding Officer, Co H, Marine Cryptologic Support Battalion, San Antonio, TX. After command, Maj. Henry reported to I MEF G2 where he participated in Operation IRAQI FREEDOM as the Deputy G2 and Intelligence Planner from AUG 2004 - AUG 2006.\r\n\r\nFrom August 2006-September 2008, Lt. Col. Henry commanded 1st Radio Battalion and executed two deployments to Iraq in support of Operation IRAQI FREEDOM. After command, he reported to the Naval War College (NWC) Newport, RI. After NWC he was assigned to Intelligence Department, HQMC, promoted to Colonel and took command of Marine Corps Intelligence Activity (MCIA) Quantico, VA in 2010.\r\n\r\nFrom 2012-2015, Col. Henry served at United States Central Command, Tampa, FL, as the J2 Operations Division Chief. From 2015-2016, Col Henry served as the Executive Officer to the Director of the Defense Intelligence Agency (DIA). From 2016-2017, Col. Henry served as the Chief of Staff, Intelligence Department, HQMC. Remaining at HQMC and upon promotion to Brig. Gen. on 20 July 2017, he served as the Director of Intelligence, United States Marine Corps until 2019.\r\n\r\nBrig. Gen. Henry assumed the role of the Director of Intelligence at United States Central Command, Tampa, FL, on 1 March 2019 and was promoted to the rank of Major General on 9 July 2021.\r\n\r\nLt. Gen. Henry was promoted to his current rank on 19 May 2022"
  },
  {
    "name": "Mr. Dan Rosen",
    "title": "Co-Founder",
    "company": "Rhodium Group",
    "bio": "Daniel H. Rosen is the co-founder of Rhodium Group, an independent economic research partnership, and leads the firm’s work on China. Mr. Rosen has worked professionally on China’s domestic economy and global commercial relations since 1992. He is widely recognized for his research on US-China relations and Asian commercial dynamics. He is affiliated with numerous think tanks focused on international economics and is an Adjunct Associate Professor at Columbia University. From 2000-2001, Mr. Rosen was Senior Adviser for International Economic Policy at the White House National Economic Council and National Security Council. He is a member of the Council on Foreign Relations, and board member of the National Committee on US-China Relations. A native of New York City, Dan graduated with distinction from the graduate School of Foreign Service of Georgetown University (MSFS) and with honors in Asian Studies and Economics from the University of Texas, Austin (BA)."
  },
  {
    "name": "Captain Jared W. Wyrick",
    "title": "Program Executive Officer, PEO Maritime",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Michael Quinn",
    "title": "Founder and Chief Growth Officer",
    "company": "Tenova LLC",
    "bio": "As a prominent voice in the military-to-civilian transition space, Sergeant Major (Ret.) Michael Quinn led our Nation’s Soldiers for more than 24 years and has an incredible passion for giving back to the Veteran community.\r\n\r\nUpon retirement from the U.S. Army in 2017, Michael gained valuable experience as the Director of Workforce Management at ProSphere, where he built workforce management dashboards, updated employee onboarding programs, built a corporate training program and led veteran recruiting initiatives. ProSphere received the Virginia Values Veterans (V3) Phoenix award as a result of his efforts.\r\n\r\nAfter a year at ProSphere, Michael continued his post-military career progression as a Senior Manager at Ernst & Young (EY) in People Advisory Services, where he led change management, training, and communication work streams for the largest contract in the firm’s Government & Public Sector. Michael also spearheaded a military spouse hiring initiative at EY that resulted in hiring 100+ military spouses for contract roles across the entire United States in less than 90 days.\r\n\r\nBut the overwhelming challenges Veterans faced entering the workforce stayed at the front of Michael’s mind and he resolved to make a difference, so he left EY to focus full-on HireMilitary. Through his interaction with industry leaders, posts on LinkedIn, \r\nworkshops across military installations, personal mentoring, and advising military leaders on transition assistance initiatives, Michael is positively impacting the lives of thousands of Veterans.\r\n\r\nA multi-year member of Forbes Coaches Council and 3x LinkedIn Top Voice with more than 373,000 followers, Michael’s daily posts are intended to provide guidance, motivation, and wisdom that keep the military community “Always Moving Forward” to their next career goal. As the Founder and Chief Growth Officer of HireMilitary, Michael is responsible for the growth of the company and its ecosystem of Veteran-focused brands. \r\n\r\nIn addition to his responsibility as Chief Growth Officer, Michael provides tailored training packages to multi- billion-dollar companies, small businesses, non-profits, and defense organizations to improve their social media marketing, outreach & personal/professional branding. He teaches the power of LinkedIn and networking to General/Flag Officers from all branches of the service as a part of their service transition courses. Michael typically leads 50+ webinars, live events & in-person workshops a year."
  },
  {
    "name": "Ms. Alison Messick",
    "title": "Chief Programs Officer",
    "company": "Navy SEAL Foundation",
    "bio": "As the Chief Programs Officer of the Navy SEAL Foundation (NSF), Alison leads comprehensive programming and critical support for the NSW force and their families, ensuring growth, stability, and effectiveness. She oversees a $24 million annual budget, evaluates programs for efficacy, and implements policies for improvement. Alison collaborates with experts and thought leaders to drive innovation, addressing key issues and identifying solutions. She also plans and executes NSF's Impact Forum and Thought Leaders' Symposium, fostering collaboration between federal and non-federal entities to enhance collective impact.\r\n\r\nAlison has over 20 years of experience in active duty and support services, specializing in military family readiness and organizational training. She served more than four years as a United States Marine in a frequently deployed unit with high-level security clearance. Previously, she was a Marine Corps Family Readiness Officer and Warrior and Family Support Coordinator at Naval Special Warfare (NSW) Group TWO, earning the Department of the Navy Meritorious Service Civilian Medal for her impact on NSW warriors and families.\r\n\r\nHer deep understanding of the NSW community’s challenges stems from decades of service with the U.S. Marine Corps, U.S. Navy, and Naval Special Warfare. Alison holds a Bachelor of Arts in history and journalism from the University of Maryland University College, a Master of Arts in government from Regent University, and a Graduate Leadership Certificate from the University of Virginia. She is a CliftonStrengths and EQI 2.0/EQ 360 Coach and a member of The National Medal of Honor Leadership Institute Flagship Cohort."
  },
  {
    "name": "Ms. Jennifer Zientz, MS, CCC-SLP",
    "title": "Director of Programs, Head of Clinical Services",
    "company": "Center for BrainHealth",
    "bio": "Jennifer Zientz, Director of Programs and Head of Clinical Services at Center for BrainHealth®, focuses on the translation of BrainHealth research to improve how people think, work, and live. Jennifer administers performance-based assessments and facilitates training workshops that empower individuals across the lifespan to take the lead in strengthening their focus, mental efficiency, reasoning, and possibility thinking.\r\n\r\nShe has facilitated SMART™ Brain Training for specialized groups, including military leadership, active-duty special operators, veterans and their spouses, law enforcement officers, corporate executives and leadership teams, community leaders, athletes, and graduate students.\r\n\r\nHer career in clinical research and translational application has contributed to the growing knowledge of the impact of cognitive training in health. Jennifer’s early work focused on the important role that complex language processing plays in the diagnosis and treatment of dementias. She also worked to define best practices for speech-language pathologists in the path of care for individuals with Alzheimer’s disease."
  },
  {
    "name": "Dr. Joe Bonvie, PsyD, ABPP",
    "title": "Senior Director of Clinical Services, Home Base",
    "company": "Instructor, Harvard Medical School",
    "bio": "Dr. Bonvie is a board-certified clinical psychologist and seasoned operational psychologist with over two decades of experience in human performance, leadership, and resilience. A retired U.S. Navy Captain with 21 years of active-duty service, he is one of only three Navy Psychologists to have earned both Junior and Senior Psychologist of the Year recognition, highlighting his impact on military mental health and operational readiness.\r\n\r\nCurrently, Dr. Bonvie serves as the Senior Director of Clinical Services at Home Base, a partnership between Massachusetts General Hospital and Harvard Medical School, overseeing clinical programs focused on military service members and veterans' mental health. He is also an Instructor at Harvard Medical School, providing consultation, staff supervision, and contributing to research. Additionally, he is the Principal of Fulcrum Applied Psychology, LLC, a consultancy that specializes in talent management, leadership development, and human factors optimization. With 23 years of experience, Dr. Bonvie has worked with special operations forces, professional athletes, Olympians, venture capitalists, and international organizations, helping them enhance performance in high-pressure environments.\r\n\r\nThroughout his military career, Dr. Bonvie held key roles, including Force Psychologist for Navy Expeditionary Combat Command and Director of Operational and Performance Psychology at Naval Special Warfare Development Group. He developed embedded behavioral health and resilience programs, with expertise in talent management, leadership preservation, and high-risk occupation assessment. Dr. Bonvie also served as the Lead Operational Psychologist for nine deployed Joint Task Forces, offering crucial psychological insights in high-stakes operations.\r\n\r\nDr. Bonvie is also a Senior Faculty Team Lead at the Leadership and Freedom Center, where he designs leadership curricula for executives. He has served as a Mental Skills Consultant for the Baltimore Orioles, applying psychological insights to improve player performance and team culture.\r\n\r\nHis military awards include the Legion of Merit Medal, two Bronze Star Medals, and three Presidential Unit Citations. He holds Board Certification in Clinical Psychology (ABPP), Certified Mental Performance Consultant (CMPC), and Board Certified Coach (BCC). Dr. Bonvie continues to drive advancements in human performance, resilience, and leadership."
  },
  {
    "name": "Dr. David Rudd, PhD, ABPP,",
    "title": "Distinguished University Professor of Psychology and President Emeritus",
    "company": "University of Memphis",
    "bio": "M David Rudd, PhD, ABPP, is President Emeritus and Distinguished Professor of Psychology at the University of Memphis.  He also direct the Rudd Institute for Veteran and Military Suicide Prevention. He completed his doctoral training at the University of Texas-Austin, and finished a post-doctoral fellowship in cognitive therapy at the Beck Institute in Philadelphia, under the direction of Aaron T. Beck. He is a Diplomate of the American Board of Professional Psychology and a Fellow of professional societies including the American Psychological Association, the International Association of Suicide Research, and the Academy of Cognitive Therapy. He was elected Distinguished Practitioner and Scholar of the National Academies of Practice in Psychology. In addition to his clinical work, he is an active researcher with over 270 publications, an h-index of 67, an i10-index of 154 and over 19,000 citations and over $32M in aggregate funding. He has authored several books, including Brief Cognitive Behavioral Therapy for Suicide Prevention, Treating Suicidal Behavior, Suicide Science: Expanding the Boundaries, The Assessment and Management of Suicidality: A Pocket Guide, The Interpersonal Theory of Suicide, and Managing Suicide Risk in Primary Care. His research has been recognized both nationally and internationally. He has served as a consultant to many organizations worldwide, including the United States Air Force and Army, the Department of Defense, and the Beijing Suicide Prevention and Research Center. In addition, he serves on a number of editorial boards, including his positions as past Chair of the Texas State Board of Examiners of Psychologists, past President of the Texas Psychological Association, past President of Division 12 Section VII of the American Psychological Association, past Past-President of the American Association of Suicidology, and previously a member of the APA Council of Representatives."
  },
  {
    "name": "Reverend Christopher Shimmen RN",
    "title": "Padre",
    "company": "Commando Training Center, Royal Marines, UK",
    "bio": "The Reverend Christopher Shimmen is a Royal Navy Chaplain who currently serves the Royal Marine Commando community as a Padre.\r\n\r\nChris served in the Royal Marines as a soldier from 1996 to 2011. Operationally, he served extensively in the Balkans and across the Middle East as both a soldier and chaplain. \r\n\r\nDriven by his faith and service, his heart and focus shifted from front line military operations as a combatant to the deeper dimensions of soldiers' hearts and minds, and more broadly, the moral component of a fighting force's operational capability. In 2011, he answered a compelling call to ministry.\r\n\r\nOrdained in 2014, Chris served a large city church in Notting Hill, Kensington, London. In 2019, eight years after leaving the Royal Marines, Chris’s enduring respect for the Armed Forces and its personnel motivated him to rejoin the Royal Navy as a Chaplain. \r\n\r\nChris understands that warfighting encompasses visible and invisible forces, and among the invisible forces, the spiritual component exists, underpinning and weaving through every aspect of a soldier and ‘fighting power’. He believes this spiritual dimension is a vital force multiplier, strengthening the resilience of our people and enhancing operational effectiveness.\r\n\r\nHe hopes that his experiences and insights from both sides of the wire, as a combatant and a chaplain, can provide a unique perspective to engage pastorally at a deeper level with the service personnel under his spiritual care, as well as supporting the spiritual and moral components at the Command level.\r\n\r\nChris is an enthusiastic supporter of the finest football team in the UK, Tottenham Hotspur! He is married with two children."
  },
  {
    "name": "Sergeant Major Christopher M. McNamara",
    "title": "Human Weapon System Director",
    "company": "United States Army Special Operations Command",
    "bio": "Sergeant Major Christopher M. McNamara entered the United States Army in June of 2002, and has dedicated over two decades to optimizing warfighter performance in high-stakes environments. Beginning his career as a Combat Medic in the 75th Ranger Regiment, he quickly established himself as a leader in battlefield medicine and operational readiness. His expertise led him to the United States Army Special Operations Command (USASOC), where he served in multiple roles, including Special Operations Troop Medic, Team Sergeant, the Assault Medic Course Director, Operations Sergeant Major, and Squadron Sergeant Major. He now culminates his career as the Human Weapons System Subject Matter Expert (SME) for his unit, spearheading initiatives to enhance the readiness and resilience of SOF warfighters.\r\n\r\nSGM McNamara’s operational experience spans 15 combat deployments across global theaters, including multiple tours in support of presidentially directed Crisis Response Operations, Operations IRAQI FREEDOM and INHERENT RESOLVE, and Operation ENDURING FREEDOM. His frontline experience in austere, high-threat environments has shaped his approach to improving human performance under extreme conditions.\r\n\r\nA lifelong student of warrior overmatch, SGM McNamara has completed extensive training in direct action, special reconnaissance, small unit tactics, operational infiltration and extraction methods for use in combat and crisis response operations. He subsequently applied those skills over nearly five years of combat experience.  As an organizational leader, he was given the mission of creating lethal, adaptable, and resilient warfighters capable of executing complex missions in dynamic environments. This meant expanding beyond a traditional battlefield focus into holistic human performance optimization, neuroscience, recovery strategies, and physiological resilience tools designed to enhance SOF lethality, durability, and long-term readiness.\r\n\r\nAs a panelist at SOF Week’s discussion on Advancing the Warrior’s Edge: Leveraging Breakthroughs in Human Performance for Lasting Impact On and Off the Battlefield, SGM McNamara brings a unique operational perspective to the future of warrior optimization. His insights bridge the gap between cutting-edge research and real-world application, ensuring that the next generation of SOF personnel is not only prepared for the fight but primed for sustained excellence beyond it."
  },
  {
    "name": "Rear Admiral Milton \"Jamie\" Sands III",
    "title": "Commander",
    "company": "Naval Special Warfare Command",
    "bio": "Rear Adm. Sands is a native of Farmington, Connecticut and graduated from The United States Naval Academy in 1992 with a Bachelor of Science in Oceanography.  He holds a Master’s in Military Strategy and Planning from the Joint Advanced Warfighting School in Norfolk, Virginia. \r\n\r\nHis operational tours included surface warfare officer assignments onboard Newport-class tank landing ship USS Saginaw (LST 1188) and Spruance-class destroyer USS John Rodgers (DD 983).  After graduating Basic Underwater Demolition / SEAL (BUD/S) training with class 203, he was assigned to SEAL Delivery Vehicle Team 1. Additional assignments include two tours with SEAL Team 2, and assignment to a joint task force in Afghanistan. Sands served as an operations officer for a joint task force in Iraq; chief of staff, Naval Special Warfare Group 2; and chief of staff, Naval Special Warfare Development Group. He commanded SEAL Team 8, a Joint Task Force in Iraq, and Naval Special Warfare Group 2.\r\n\r\nAshore Sands was a joint planner at Special Operations Command, Europe; a Counter Terrorism and Public Policy Fellow at Duke University’s Sanford, School of Public Policy as part of the Navy’s Federal Executive Fellowship program; director of Counter Terrorism and Operations for the Assistant Secretary of Defense for Special Operations and Low Intensity Conflict; deputy operations officer, Joint Special Operations Command; and vice president, Joint Special Operations University. \r\n\r\nSands' flag officer tours include chief of staff, U.S. Special Operations Command; commander, Special Operations Command Africa; and commander, Naval Service Training Command.\r\n\r\nSands is authorized to wear the Defense Superior Service Medal (2 awards), Legion of Merit, Defense Meritorious Service Medal (3 awards), Bronze Star Medal (2 awards), as well as various other personal, unit and service awards."
  },
  {
    "name": "Mr. Jeffery \"JD\" Barnes",
    "title": "Chief, International Operations, SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Heidi Grant",
    "title": "Former Director of Defense Security Cooperation Agency",
    "company": "U.S. Department of Defense",
    "bio": "Heidi Grant is president of business development, where she leads a team representing Boeing’s defense, space and government services portfolios around the world.\r\n\r\nGrant joined Boeing in November 2021 from the U.S. Department of Defense, having served as director, Defense Security Cooperation Agency, responsible for all DoD security cooperation programs involving defense articles, military training and other defense-related services. There, she oversaw more than 15,000 military sales cases with more than 150 countries valued at more than $600 billion. She also managed a certification program for 20,000 civillian and military personnel.\r\n\r\nBefore joining DSCA, Grant was director, Defense Technology Security Administration, responsible for developing and implementing global technology security policies for international transfer of defense-related goods, services, and technologies.\r\n\r\nIn 2002, Grant was appointed to the Senior Executive Service and assigned as the first civilian director, resources and analysis, for U.S. operations in the Middle East, Central and South Asia and North East Africa. Working with senior representatives from 65 countries, she led resource strategy and analysis for operations Iraqi Freedom and Enduring Freedom.\r\n\r\nShe later helped establish U.S. Africa Command as its first director of resources, leading personnel and financial programming that served as the foundation for successful interagency and international partnerships for global security.\r\n\r\nFrom 2010 through 2018, Grant served as deputy under secretary of the Air Force, International Affairs, providing oversight and guidance for international policy and for programs supporting global national security objectives; technology and information disclosure; security assistance; education and training; and cooperative research and development. She also managed the Air Force Foreign Liaison Office and attaché affairs.\r\n\r\nGrant holds a Master of Public Administration in financial management from Troy State University and a Bachelor of Science in business from Pfeiffer University. She is a member of the Council on Foreign Relations."
  },
  {
    "name": "Dr. John Edgar Caterson",
    "title": "U.S. Special Operations Command SOCH ESME, SOCH Program Director",
    "company": "Joint Special Operations University",
    "bio": "Dr. John Edgar Catterson serves as the SOCOM SOCH Joint Special Operations University Executive Subject Matter Expert (ESME) and as the Program Director for the Special Operations Chaplains Advanced Courses Program (SOCAC), as well as the Master SOF Instructor of Record for the SOF Ethical Leadership Advisement, the Spiritual & Moral Resiliency, Special Operations Crisis Care and Counseling, and Religious Support Team Orientation.\r\n\r\nA graduate of Princeton Theological Seminary, The University of Edinburgh in Scotland, and The Beeson International Center at Asbury Theological Seminary, he holds a Bachelor of Arts in Philosophy & Religion, a Master of Divinity with a concentration in ethics, was a Supervised Post-Graduate Fellow in Ethics & Leadership, and earned a Doctorate degree with concentrations in Story Integration, Narrative Theology, Leadership & Ethics, and Psychology."
  },
  {
    "name": "Sergeant Major (Ret.) Mike Vining",
    "title": "Director, National EOD Association",
    "company": "U.S. Army Special Forces",
    "bio": "Sergeant Major (Ret.) Mike Vining is a director and assistant historian for the National Explosive Ordnance Disposal (EOD) Association and conducts historical EOD research for the EOD Warrior Foundation.\r\n\r\nHe served in the United States Army 1st Special Forces Operational Detachment - Delta and Joint Special Operations Command, retiring from active duty as a sergeant major in 1999. He attended the first Operator Training Course (OTC-1) and served as an Operator, EOD, Master Breacher, R&D SGM, and Breach R&D SGM.\r\n\r\nIn Special Forces, he served in the 10th Group, 1st Group, SWC at the Noncommissioned Officers Academy, and in the 3rd Group. He has held the positions of communications sergeant, senior communications sergeant, senior small group leader, team sergeant, and advanced skills company committee chief.\r\n\r\nMr. Clark graduated from Campbell University in Buies Creek, North Carolina, in 2006, earning a Bachelor of Science in History. He then graduated from Webster University in St. Louis, Missouri, in 2007, earning a Master of Arts in Human Resource Development."
  },
  {
    "name": "Master Sergeant (Ret.) Mike Clark",
    "title": "Course Manager, College of SO/LIC",
    "company": "Joint Special Operations University",
    "bio": "Master Sergeant (Ret.) Michael W. Clark II is a faculty member in the College of Special Operations & Low-Intensity Conflict at the Joint Special Operations University. He served in the United States Army Special Forces, retiring from active duty as a master sergeant in 2014.\r\n\r\nIn Special Forces, he served in 10th Grp, 1st Grp, SWC at the Noncommissioned Officers Academy, and in 3rd Grp. He has held the positions of communications sergeant, senior communications sergeant, senior small group leader, team sergeant, and advanced skills company committee chief.\r\n\r\nMr. Clark graduated from Campbell University in Buies Creek, North Carolina, in 2006, earning a Bachelor of Science in history. He graduated from Webster University in St. Louis, Missouri, in 2007, earning a Master of Arts in human resource development."
  },
  {
    "name": "Petty Officer First Class (Ret.) Mike Kipp",
    "title": "The Veterans Project",
    "company": "U.S. Navy SEAL",
    "bio": "Mike served for eleven years in the US Navy Special Forces. During his time in the military, he performed a number of highly classified missions around the world. Prior to suffering serious injuries that forced an early departure from the military, Mike did three years in Vietnam, helped rescue a group of children from a slave operation out of Mexico, assisted in stopping the drug trade coming out of Colombia, trained a number of Special Forces groups from various countries including Korea, the Philippines, South Vietnam, and the Shah of Iran's Royal Guard. He led operations into North Korea, Ukraine, and Czechoslovakia. His service includes working with Israel, Germany, England, Spain, France, and other Allied countries.\r\n\r\nMike's time in the military and during his civilian career has allowed him to perform operations for Presidents Nixon, Ford, and Clinton. On several occasions, he has led operations and briefed members of the Joint Chiefs of Staff, members of the US Congress and Senate, as well as dignitaries from a number of different countries.\r\n\r\nCurrently, Mike sits on several veterans' boards and works to help veterans whenever and wherever he can. He was honored by five different veterans' associations for his untiring voluntary service. Mike assists with veterans' suicide prevention, Special Forces Associations, and is working to change legislation that would help improve disabled veterans' quality of life.\r\n\r\nIn addition, Mike consults with the Haitian government in helping to resolve the violence that is currently overwhelming the country, as well as assisting in the planning for the rebuilding of the country after a number of devastating earthquakes, gang violence, hurricanes, and other natural disasters.\r\n\r\nOver his career, Mike has received a number of awards, degrees, and decorations."
  },
  {
    "name": "Dr. Anna Simons",
    "title": "Professor Emerita",
    "company": "Naval Postgraduate School",
    "bio": "Anna Simons is a Professor Emerita of Defense Analysis at the Naval Postgraduate School. She taught there from 1999-2019, after six years as an assistant and then associate professor of anthropology at UCLA.\r\n\r\nShe has written several books and multiple monographs, and has overseen projects for offices within the Office of the Secretary of Defense, as well as for several different military commands. As a member of the DA Department, Anna happily taught courses in the anthropology of conflict, military advising, low-intensity conflict in Africa, political anthropology, and comparative SOF. She also ran six iterations of the Long-Term Strategy Seminar sponsored by the Office of Net Assessment.\r\n\r\nOnce upon a time, she attended Harvard, briefly worked as a journalist, then as a presidential speechwriter, spent multiple years as a vagabond (predominantly in Africa and Israel), accidentally went back to Harvard for her PhD, and even more accidentally ended up in Somalia for her dissertation fieldwork. Way back when, she had hoped to live with camel nomads. She now lives in Montana among cattle ranchers."
  },
  {
    "name": "Sergeant Major Adam Thompson",
    "title": "Commandant",
    "company": "Joint Special Operations Forces Senior Enlisted Academy",
    "bio": "CSM Adam Thompson is the Commandant of the Joint Special Operations Senior Enlisted Academy (JSOFSEA) at USSOCOM. JSOFSEA develops senior enlisted SOF professionals to think critically, creatively, and ethically about dynamic and complex problem sets at operational and strategic levels, creating the ultimate \"Warrior-Diplomats.\"\r\n\r\nCSM Thompson ensures that students gain valuable knowledge and experience to successfully lead in the joint, interagency, intergovernmental, and multinational (JIIM) environment.\r\n\r\nCSM Thompson is a U.S. Army Green Beret with 24 years of service. His most recent assignment was serving as the Course Director for JSOFSEA CEP 3. He is a Master Training Specialist and provides perspective and direction to instructors as they administer a curriculum that is the cornerstone of success for future Senior Enlisted Leaders in the Joint SOF enterprise."
  },
  {
    "name": "Ms. Catherine Herridge",
    "title": "Independent investigative journalist",
    "company": "Atlas Media",
    "bio": "Catherine V. Herridge is an Emmy Award‐winning veteran investigative correspondent who covers national security and intelligence. In February, Herridge was held in civil contempt by a US federal court for refusing to disclose her confidential sources for a series of national security reports in 2017.\r\n\r\nAs a senior investigative correspondent for CBS News from 2019-2024, Herridge’s reporting was a catalyst for legislative change affecting more than a million American veterans and civilians. The Investigative Unit’s Emmy‐nominated series “Decades of Exposure” is credited by activists and lawmakers with the passing of the Camp Lejeune Justice Act in August 2022.  Part of the burn pit legislation known as the PACT ACT, the law is considered one of the largest expansions of VA healthcare and benefits for American veterans.\r\n\r\nIn 2021, Herridge and the CBS News Investigative Unit won the Society of Environmental Journalists’ Kevin Carmody Award for Outstanding Investigative Reporting, for a year-long probe that exposed serious health hazards at the K-2 military base in Uzbekistan that supported Special Operations missions into Afghanistan after 9/11. In response to Herridge’s reporting, an Executive Order recognized K2 veterans and mandated a comprehensive Defense Department study on the health consequences.\r\n\r\nHerridge’s recent reporting on retired Col. Paris Davis, one of the first Black officers in the elite Green Berets, kept his story in front of government decision makers and helped right a 58-year-old wrong. In March 2023, the Vietnam hero was awarded the Medal of Honor at the White House for his heroism at the 1965 Battle of Bong Son after his nomination paperwork was lost twice at the height of the civil rights movement. Race was blamed as a factor.\r\n\r\nHerridge has reported from Afghanistan, Iraq, Qatar, Israel, Northern Ireland, Russia and the former Yugoslavia.   Prior to joining CBS News, Herridge was the chief intelligence correspondent for FOX News Channel (FNC), and a TV and radio correspondent for ABC News in London.  In 2019, the Congressional Medal of Honor Society awarded Herridge with its annual Tex McCrary Award for excellence in journalism.\r\n\r\nShe is a graduate of Harvard College and the Columbia School of Journalism where she founded a national security reporting scholarship.  Herridge comes from a military family and lives in Washington, D.C., with her husband, a West Point graduate, and their two boys."
  },
  {
    "name": "His Majesty King Abdullah II ibn Al Hussein",
    "title": "King of Jordan",
    "company": "Hashemite Kingdom of Jordan",
    "bio": "Born in Amman in 1962, His Majesty King Abdullah II ibn Al Hussein attended Oxford University and the School of Foreign Service at Georgetown University, received his military education at Britain’s Royal Military Academy Sandhurst and pursued a distinguished military career, rising from first lieutenant to major general and serving as commander of Jordan’s special forces. In February 1999, he ascended to the Throne of the Hashemite Kingdom of Jordan after the passing of his father, His Majesty King Hussein.\r\n\r\nKing Abdullah II has devoted himself to defending Jordan as an island of progress in a turbulent region. This has included investing in the immense human capital of his people, combating terrorism and extremism within a holistic approach, and working to expand peace prospects in the Middle East. \r\n\r\nAs the 41st generation direct descendant of the Prophet Muhammad, King Abdullah II has taken the lead in advancing harmony both within Islam and among the world’s great religions. In 2004, he launched the “Amman Message,” the first major initiative by a Muslim leader to affirm that terrorism and violence have no place in Islam. In 2006, His Majesty supported and funded “A Common Word Between Us and You”, which calls for peace and harmony between Muslims and Christians. And in 2010, the United Nations General Assembly unanimously adopted his proposal for a World Interfaith Harmony Week, which has been observed annually ever since in the first week of February.\r\n\r\nIn 2015, His Majesty launched the Aqaba Process initiative to enhance regional and international coordination to counter terrorism and extremism within a holistic approach that extends to the military, security, and ideological dimensions.\r\n\r\nIn recognition of his efforts to promote peace, spread interfaith harmony, and safeguard Islamic and Christian holy sites in Jerusalem under the Hashemite Custodianship, King Abdullah II has received several prestigious awards, including the Peace of Westphalia Prize, the Templeton Prize, Italy’s Lamp of Peace of St. Francis, the Scholar-Statesman Award from the Washington Institute for Near East Policy, the Zayed Award for Human Fraternity, and the Path to Peace Award.\r\n\r\nHis Majesty is married to Her Majesty Queen Rania Al Abdullah. They have four children—two sons, Their Royal Highnesses Crown Prince Al Hussein and Prince Hashem, and two daughters, Their Royal Highnesses Princess Iman and Princess Salma."
  },
  {
    "name": "Colonel Amanda Robbins",
    "title": "Command Psychologist",
    "company": "Headquarters, U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Larry Royer, LCSW, BCD",
    "title": "Licensed Clinical Social Worker",
    "company": "KBR",
    "bio": "Larry enlisted in the Army July 1992 as a Pharmacy Tech. He served 18 years Active Duty and was promoted to MSG. He then applied and was accepted into the Army MSW program and commissioned as a 2LT in October 2010. Larry spent 14 years as an LCSW and retired in July 2024. As an LCSW, served with the 101st Airborne and deployed with the Rakkasans. Larry spent 8 years in USASOC, 6 of those in 3D SFG(A) and 2 in SWCS. Larry graduated in 2003 with his Bachelors of Science, 2010 with his Masters of Healthcare Administration and in 2011 with his Masters of Social Work. He currently serves as a POTFF contractor for KBR, supporting the Military Free Fall School at Yuma Proving Grounds and the Directorate of Psychological Applications at Ft Bragg. Larry is married to Vivian of 17 year and they have 4 beautiful children and 1 grandson."
  },
  {
    "name": "Ms. Jodi Burns",
    "title": "Chief Executive Officer",
    "company": "Special Forces Charitable Trust",
    "bio": "Jodi Burns is a dedicated advocate for the Special Forces community, serving as the CEO of the Special Forces Charitable Trust. With decades of experience supporting military families, she has committed her life to ensuring Green Berets and their loved ones receive the care and resources they deserve. \r\n\r\nBefore leading the Trust, Jodi spent over 11 years developing and directing a BUMED funded program with the Center for Military Relationships & Family, focused on strengthening the Special Operations community. Through this work, she built deep connections and developed programs addressing the unique challenges faced by SOF families. She brought that experience to the Trust, expanding its impact and ensuring critical support reaches those who need it most. \r\n\r\nAs the wife of a U.S. Navy SEAL for 28 years, Jodi has personally endured the trials of military life—raising children through more than 12 combat deployments and navigating the sacrifices that come with service. Her firsthand experience fuels her passion for advocating for SOF families, ensuring they receive support that is both immediate and lasting. \r\n\r\nUnder Jodi’s leadership, the Special Forces Charitable Trust continues to grow, offering essential programs that strengthen families, provide emergency aid, and promote long-term wellness. She is a champion for those who stand behind America’s elite warriors, ensuring they are never forgotten."
  },
  {
    "name": "Ms. Kerry Irvin",
    "title": "Chief Executive Officer",
    "company": "Operation Healing Forces",
    "bio": "With a strong background in nonprofit development and executive leadership, Kerry has a proven record of strategically growing sustainable, impactful organizations. As a veteran spouse deeply connected to the Special Operations Forces (SOF) community—and as the daughter, wife, and mother of U.S. Service Members—she brings a personal understanding of the sacrifices and challenges faced by military families.\r\n\r\nNow leading Operation Healing Forces (OHF) into its next phase of growth, Kerry is committed to building strategic partnerships nationwide to expand OHF’s programs and capacity. Her vision is to strengthen OHF’s ability to support SOF service members, their families, and caregivers with vital resources and assistance.\r\n\r\nBeyond her role at OHF, Kerry has long supported the military community as a Master Resilience Trainer, Applied Suicide Intervention Skills Training (ASIST) facilitator, and Transition Assistance Program (TAP) employment facilitator. She also serves on the board of directors for the Military Special Operations Family Collaborative and sits on the TEACH Family Advisory Panel for the THRIVE program at UNC-Chapel Hill.\r\n\r\nHer advocacy has earned recognition at the highest levels, including the President’s Lifetime Achievement Award, the Secretary of the Army’s Superior Public Service Medal, and three Military Spouse of the Year honors. Kerry is also a respected voice for military families as a columnist for Military Times, where her \"The Home Front\" column highlights the challenges and triumphs of military life.\r\n\r\nThrough her leadership, advocacy, and deep commitment to service, Kerry continues to drive meaningful change for the military and veteran communities OHF supports."
  },
  {
    "name": "Ms. Maria Cherjovsky",
    "title": "Chief Executive Officer",
    "company": "Camaraderie Foundation",
    "bio": "Maria Cherjovsky has dedicated over 25 years to workforce development, nonprofit management, social services, and higher education, addressing employer needs while supporting underserved groups. She has held executive roles at the University of Central Florida and local nonprofits, including Vice President of Mission Services and Workforce Innovation for Goodwill Industries of Central Florida, Vice President of Operations for the Coalition for the Homeless, President of the Florida Diversity Council, President of the Central Florida Disability Chamber of Commerce (now the Florida Abilities and Inclusion Network), and Executive Director of AMCSI, a national disability inclusion organization. Additionally, Maria spent 10 years as a college professor and over 15 years as a career coach, instructional designer, project manager, marketing expert, and consultant, both domestically and internationally, helping transform organizations and develop high-performing teams.\r\n\r\nMaria’s commitment extends beyond her professional roles, volunteering with community organizations, nonprofits, and workforce agencies for nearly two decades. She has served on the planning committee for the Interservice/Industry Training, Simulation, and Education Conference (I/ITSEC), the world’s largest modeling, simulation, and training event. Her contributions have been recognized by the United States Congress, National Diversity Council, National Defense Industrial Association, National Training & Simulation Association, Australian Royal Navy, Society for Human Resource Management, Gabor Organization, and the Adult and Continuing Higher Education Association (ACHE). In 2020, she received the inaugural \"Diversity in Business Lifetime Achievement Award\" from the Orlando Business Journal.\r\n\r\nMaria holds a Bachelor’s degree in Business Administration and a Master’s degree in Instructional Systems Design. She has also completed coursework toward a doctoral degree and earned several Master’s certificates in Project Management, Human Resource Management, and Career Counseling. She is a National Diversity Council Certified Diversity Professional (NDCCDP) and a frequent speaker at regional and national conferences. Maria lives in Central Florida with her husband and children."
  },
  {
    "name": "Command Sergeant Major (R.) Matt Kitchin",
    "title": "Former Commandant",
    "company": "Joint Special Operations University Enlisted Academy",
    "bio": "CSM Matt Kitchin, a native of Vermont, enlisted in the United States Navy in January 1993. He attended basic training at Recruit Training Command and Aviation controller ‘A’ school in Great Lakes, Illinois, and was assigned to the USS SAIPAN LHA-2 based out of Norfolk Naval Base, Virginia. He enlisted in the United States Army in September 1998 as an M1 A-1 Abrams Tank Mechanic, attending Basic Training at Ft. Leonardwood, Missouri and Advanced Individual Training at Ft. Knox, Kentucky.  As an Abrams mechanic, he served at Fort Riley, Kansas and Fort Stewart, Georgia.  \r\n\r\nCSM Kitchin attended Special Forces Assessment and Selection in 2001, graduating the Special Forces Qualification Course as an 18C (Special Forces Engineer) in 2003. Assigned to 10th Special Forces Group (Airborne), CSM Kitchin held positions as an Operational Detachment Alpha (ODA) Engineer, ODA Operations Sergeant, First Sergeant, Company Sergeant Major, BN Operations Sergeant Major and served as the 1ST BN 10TH SFG(A) Command Sergeant Major. He has also served at the NATO Special Operations Headquarters (NSHQ) on SHAPE, Mons, Belgium, as the NSHQ First Sergeant, and in Stuttgart Germany as the Special Operations Command Europe J3 Senior Enlisted Advisor. From 2008 to 2011, CSM Kitchin served at the Military Freefall School in Yuma, Arizona, as a basic course instructor and assisted in establishing the Advanced Tactical Infiltration Course (ATIC) in 2009.\r\n\r\nCSM Kitchin has completed numerous combat deployments in support of Operation IRAQI FREEDOM, Operation ENDURING FREEDOM, and Operation ATLANTIC RESOLVE.\r\nHis awards and decorations include the Defense Meritorious Service Medal, Purple Hearts, Bronze Star, Army Commendation Medal and various unit and campaign awards. He has earned the Combat Infantry Badge, the Special Forces Tab, Master Parachutist Badge and Military Freefall Parachutist Jumpmaster Badge with combat star.\r\nCSM Kitchin is a graduate of the Joint Special Operations Forces Senior Enlisted Academy at the Joint Special Operations University, MacDill AFB, Florida"
  },
  {
    "name": "Dr. Sarah Anderson, PsyD, CMPC",
    "title": "Director of Ascent Transition & Professional Development Program",
    "company": "U.S. Air Force Special Operations Command",
    "bio": "Sarah is the director of the Ascent Transition & Professional Development Program within an AFSOC-GSU unit at Pope Army Airfield. Her background is in the sport and performance psychology and clinical counseling fields.  She has experience in those roles working for the Army and within collegiate and youth sports. She has her degree in sport psychology and master’s degree in clinical counseling and is a Certified Mental Performance Coach through the Association of Applied Sport Psychology. Her most important roles and achievements are that she is a mother to four children and a spouse to recently retired US Army Solider, Charlie.\r\n\r\nSarah was raised in a ‘dugout’ in Mobile AL, daughter to a collegiate baseball coach and elementary school teacher. She is the second of four children, and still very close (and competitive) with her siblings. Her journey working with the military began in 2013 in Fort Jackson, SC doing performance psychology training with Basic Combat Training trainees. Throughout multiple PCS’s and family-life changes, her passion to work for the military and provide meaningful skills-training & professional development to this population never wavered. In 2022 Sarah was assessed and selected to work for an elite Air Force Special Operations unit to run their new Transition and Professional Development program: Ascent.\r\n\r\nAscent assists its unit members and others within the SOF community to navigate their unique transition out of the military and into civilian life, helping them to find purpose and passion in their next chapter(s). Through personal one-on-one meetings, transition workshops, & networking events Ascent has provided personalized assistance to many SOF members as they begin their next meaningful journey. Sarah enjoys both the work with the service members, as well as the transition assistance community at large that she gets to interact and work with on a regular basis (Donovan & Bank, THF, Commit, Hiring our Heroes, SOTF, META, and so many more). In the last three years, Ascent has assisted over 300 special operators and support members as they transition from military into civilian life. Ascent also plays a role in developing and implementing the personal and professional development courses for the AFSOC unit it falls under. From developing courses for future Troop Chiefs and Team Leaders, to implementing soft skills development workshops, the Ascent program prepares its unit members to be the best while in uniform and after."
  },
  {
    "name": "Mr. Tony Mayne",
    "title": "Executive Director",
    "company": "The GallantFew",
    "bio": "Tony Mayne is the Executive Director of GallantFew and a Transition Counselor for Three Rangers Foundation, serving the 75th Ranger Regiment. Previously, Tony served enlisted and as an officer in the Army for 20 years, with 12 years in the U.S. Special Operations Command, including nine years in the Ranger Regiment.\r\n\r\nDuring his 14th year in service, Tony went through the Physical Evaluation Board process and, thanks to his leadership, was able to continue to serve, switching to the Public Affairs functional area. As the Regimental PAO, he spearheaded the creation of the Regiment’s operating concept for transition—Ranger for Life. While assigned to USSOCOM, his portfolio included the Warrior Care Program (Care Coalition) and the Preservation of the Force and Family (POTFF) programs.\r\n\r\nTony graduated from The Ohio State University with a B.A. in Political Science, completed the Ranger Indoctrination Program, and served in the 3rd Ranger Battalion. He was commissioned as an Infantry officer upon graduating from Clemson University with a Master’s in Human Resource Development. Tony served in the 1st Armor Division and 82nd Airborne Division before returning to the Ranger Regiment.\r\n\r\nTony’s purpose is to provide transitioning service members with timely access to the right resources delivered through counseling. He is a firm believer in the network approach when assisting service members with their reintegration into the civilian world."
  },
  {
    "name": "Mr. Austin Moore",
    "title": "Chief Executive Officer",
    "company": "Special Operations Transition Foundation",
    "bio": ""
  },
  {
    "name": "Mr. Akash Jain",
    "title": "CTO & President of USG",
    "company": "Palantir",
    "bio": "Akash Jain currently serves as CTO and President of Palantir USG. His current areas of focus include driving Palantir’s 0→1 R&D portfolio including enabling AI/ML Ops across the USG business with Palantir’s Gotham and Foundry platforms. He spends most of his time iterating with mission partners, Palantir’s engineering teams and leaders across the civilian, defense and intelligence practice areas.\r\n\r\nMr. Jain joined Palantir in 2005 as a software engineer to design and build Palantir’s Gotham platform. From there, he led the deployment and iteration of Palantir’s platform across the defense and intelligence communities in the United States and alongside critical international partners. His areas of expertise include performance, scalability, security, cloud architecture, hybrid deployment models and edge solutions.\r\n\r\nMr. Jain graduated from Stanford University in 2003 with a degree in Computer Science. He now lives in Oakland, California where he enjoys spending time with his family."
  },
  {
    "name": "Mr. Thomas Tull",
    "title": "Co-Chairman",
    "company": "TWG Global",
    "bio": ""
  },
  {
    "name": "Mr. Pete Greany",
    "title": "Program Executive Officer, PEO Services, SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": "Mr. Pete Greany is the Program Executive Officer (PEO) for Services (SV) Acquisition at USSOCOM’s Center for Special Operations Forces Acquisition, Technology, and Logistics (SOF AT&L), MacDill Air Force Base, Florida. He oversees USSOCOM’s service acquisitions, supporting Headquarters, Component Commands, and Theater Special Operations Commands with an annual total spend of $3.2 billion.\r\n\r\nPreviously, Mr. Greany served as Deputy PEO for SV since December 2021, providing executive oversight of service acquisitions. Before that, he was the Senior Program Manager for the Science and Technology (S&T) Directorate from 2018 to 2021, managing research, technology projects, SBIRs, and investment coordination between Components and Headquarters. From 2013 to 2018, he was Deputy Director for Silent Knight Radar for PEO Rotary Wing and Deputy Program Manager for Hostile Forces Tagging, Tracking, and Locating for PEO Special Reconnaissance, directing acquisition and fielding of SOF weapon and ISR systems. From 2008 to 2012, he managed USSOCOM Survivability and Individual Equipment for PEO SOF Warrior. After retiring from the Army in 2013, he transitioned to Federal Service.\r\n\r\nBefore USSOCOM, Mr. Greany held leadership roles in Army Staff, including Acquisition Branch assignment officer, Assistant Program Manager at the National Reconnaissance Office, and Combat Developer for Army Intelligence and Security Command. Commissioned as an Infantry Officer in 1992, he commanded two companies and served in leadership roles in the U.S., Europe, Southwest Asia, South America, and North Africa with the U.S. Army Infantry and Acquisition Corps.\r\n\r\nA DAWIA Level III certified Program Manager and Acquisition Corps member, Mr. Greany holds a Bachelor’s in International Relations from the U.S. Military Academy and an MBA from Webster University. He is married to Shannon, with whom he shares four children: Megan, Monyka, Madison, and Justin."
  },
  {
    "name": "Mr. Alex Flick",
    "title": "PEO-SW",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Chad Raaymakers",
    "title": "PEO-TIS",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Chris Wilson",
    "title": "Science and Technology Directorate, Capability Area Lead for Warfighter Performance",
    "company": "USSOCOM SOF AT&L",
    "bio": "Mr Chris Wilson is currently the USSOCOM SOFAT&L – Science and Technology Directorate, Capability Area Lead for Warfighter Performance.  Chris retired after 21+ years as a Medical Plans \\ Acquisition Officer in the US Army in 2016.  Has been at USSOCOM since 2013 and has managed SOCOM Biomedical & Human Performance Research Portfolio since 2021. While serving in the Army, Chris had 2 combat deployments to Afghanistan and a NATO deployment to Bosnia-Herzegovina"
  },
  {
    "name": "Mr. Garth Arevalo",
    "title": "Chief Executive Officer",
    "company": "Lukos",
    "bio": "Garth Arevalo is CEO of Lukos. Lukos is a rapidly growing federal contractor. Lukos has prime contracts supporting the military services, joint combatant commands, Department of Homeland Security, and Centers for Disease Control and Prevention with a focus on training, analytics, healthcare, and professional support. Prior to co-founding Lukos, he served in the Air Force and at Special Operations Command as a Contracting Officer. He has worked supporting special operations forces throughout the world for most of his career. He has a BS-Business Administration from Georgetown University and an MS in Entrepreneurship from the University of South Florida."
  },
  {
    "name": "First Sergeant (Ret.) Valerie Lavin",
    "title": "CEO, Luminary",
    "company": "Co-Founder, Action Zone",
    "bio": "Valerie Ellis Lavin is a retired Army First Sergeant and the CEO of Luminary Global, along with her husband, Jeremy Lavin, the company's COO. Luminary helps prevent death by providing emergency product solutions to those who are the lifeline between preventable death and hospital care.\r\n\r\nPhilanthropically, Valerie is known for her devotion to helping veterans start their businesses. Valerie's experience in startup education, program development, and event execution led to a partnership with other military veterans and spouses to create Action Zone, Inc. Recently, Valerie was named Bunker Labs Director of Ecosystem Development."
  },
  {
    "name": "Mr. Kit Werremeyer",
    "title": "Emeritus Chairman",
    "company": "SCORE",
    "bio": "Expertise in private construction, engineering, contracts and international business. 32 years US and international experience with engineering and construction business for major Engineering, Construction and Procurement (EPC) contractors in the oil, gas, refining, LNG, power, water, chemical and petrochemical sectors. Former executive with CBI, an international EPC contractor. 22 years as Owner/President of Southernstar Consultants LLC providing professional services for construction contracts training, claims and dispute resolution, and international trade with Thailand, Malaysia, Singapore, Indonesia, the Philippines, China and Japan. Provide training courses in construction contracts. Assistance with negotiating fair and balanced terms and conditions in construction contracts. Author of the book: \"Understanding and Negotiating Construction Contracts\" Second edition pubished in September, 2003. Available at Amazon.com and many other bookseller sites. US Army Vietnam war veteran."
  },
  {
    "name": "Ms. Rosalinda Vasquez Maury",
    "title": "Director of Applied Research and Analytics",
    "company": "Syracuse University’s D’Aniello Institute for Veterans and Military Families (IVMF)",
    "bio": "Rosalinda Vasquez Maury serves as the Director of Applied Research and Analytics at the D’Aniello Institute of Veterans and Military Families (IVMF) at Syracuse University. She works on a diverse research portfolio that reflects the range of social, economic, and wellness challenges that may affect transitioning service members, veterans, or their families. She has worked on numerous research efforts including workforce readiness as it relates to transitioning service members and veterans in the civilian labor force, career preferences, financial readiness, job matching and employer perspectives on retention and workplace performance, factors impacting veteran and military families business owners, and service members experiences in higher education. She has extensive experience in survey development and worldwide data collection, and has been responsible for developing, implementing and managing surveys for data collection on the large and small scale, for organizations and government sectors. Her work has been featured in numerous publication and has presented at various professional conferences. Maury holds a master’s of science and bachelor’s degrees in psychology from the University of Texas at San Antonio."
  },
  {
    "name": "Mr. Noel Hike",
    "title": "Veterans Benefit Administration Liaison",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Luis Martinez",
    "title": "Senior Pentagon Reporter",
    "company": "ABC News",
    "bio": "He has covered the U.S. military and national security issues for ABC News from the Pentagon since 2006. Prior to beginning his role at the Pentagon, Martinez covered the State Department and the U.S. Senate for ABC News. He began his career at ABC in 1989 as a desk assistant and later worked as an assignment editor and a producer in the D.C. bureau, covering a variety of national issues in Washington. Martinez is a graduate of Columbia University."
  },
  {
    "name": "The Honorable Pedro Arnulfo Sánchez Suárez",
    "title": "Minister of Defense",
    "company": "Colombia",
    "bio": ""
  },
  {
    "name": "General Raimundas Vaikšnoras",
    "title": "Chief of Defense",
    "company": "Lithuania",
    "bio": "General Raimundas Vaikšnoras was born on 12 July 1970 in Druskininkai. He started his military career on 28 February 1991 when he was assigned as an intelligence specialist to the Training Unit of the National Defence Department of Lithuania. He took the serviceman's oath on 11 March 1991.\r\n\r\nDuring his military service the General followed the path of a soldier, a sergeant and an officer. He started from the position of rifleman, then as NCO he was a section and platoon commander, later began his career as an officer. General Raimundas Vaikšnoras graduated from Platoon and Company Commander Courses in Denmark, Staff Officer Courses in Germany, Lithuania and Sweden, Joint Command and General Staff Officer Course in the Baltic Defence College, Estonia, as well as the Strategic Defence Studies at the United States Army War College. During his military service in the Lithuanian Armed Forces R. Vaikšnoras served as the Platoon and Company Commander of the Motorized Infantry troops, he was the Commander of two battalions in Rukla and Vilnius, and the Commander of the Mechanized Infantry Brigade “Iron Wolf”. In his military service, he also took the positions of staff officer and chief officer of combat training, defence planning and operations control. Once he was deployed to serve in a mission headquarters in Afghanistan. \r\n\r\nDuring his senior staff officer's career, the General was responsible for capability development and operations in the Land Force Headquarters, Joint Staff and Defence Staff of the Lithuanian Armed Forces. General R. Vaikšnoras' decorations include the Commemorative Badge to Mark Russian Troops Withdrawal from Lithuania, Medal of the Founding Volunteers of the Lithuanian Army, Honor Badge “Iron Wolf”, National Defence System of the Republic of Lithuania Medal for Deployment on International Missions, Lithuanian Armed Forces and Land Forces Medals for Distinguished Service, Lithuanian Armed Forces Medal of Merit (with Bronze Pillars) and other awards. Gen R. Vaikšnoras is a member of the Union of Founding Volunteers of the Lithuanian Armed Forces."
  },
  {
    "name": "General Javier Iturriaga del Campo",
    "title": "Commander in Chief of the Army",
    "company": "Chile",
    "bio": "General Javier Iturriaga del Campo entered the Chilean Army Military Academy in 1980 and graduated as a Second Lieutenant from the Infantry Branch on January 1st, 1984.\r\n\r\nHe holds the primary specialty of Staff Officer and secondary specialties of Commando and Paratrooper.\r\n\r\nLatest Promotions and Assignments\r\n\r\n\r\nDecember 2004: Promoted to Lieutenant Colonel.\r\nDecember 2009: Promoted to Colonel.\r\nJanuary 2012: Appointed Commander of the Reinforced Regiment No. 4 \"Rancagua\".\r\nJanuary 2013: Appointed Commander of the 2nd Armored Brigade \"Cazadores\".\r\nJanuary 2014: Appointed Military Attaché in Brazil.\r\nDecember 2014: Promoted to Brigadier General and appointed Commander of the Special Operations Brigade “Lautaro”.\r\nDecember 2016: Appointed Director of Army Operations.\r\nDecember 2017: Appointed Deputy Chief of the Army General Staff.\r\nNovember 2018: Promoted to Major General and appointed Commander of Education and Doctrine.\r\nDecember 2020: Appointed Chief of the Joint Army Staff.\r\nNovember 2021: Appointed Army Commander-in-Chief.\r\nMarch 09, 2022: Took office as Commander-in-Chief of the Army.\r\n\r\nAcademic Background\r\n\r\nMilitary Academy Professor in the subject of Tactics and Operations\r\nBachelor’s Degree in Military Science.\r\nMaster’s Degree in Military Science, specializing in Strategic Planning and Management, Chilean Army War College."
  },
  {
    "name": "Senator Nicolae Ionel Ciucă",
    "title": "Former Minister of Defense",
    "company": "Romania",
    "bio": "Nicolae-Ionel Ciucă was born on February 7, 1967, in Plenița, Dolj County, Romania. He graduated from Tudor Vladimirescu Military High School in 1985 and from the Nicolae Bălcescu Land Forces Academy in 1988. He later completed advanced studies at the National Defence University in Bucharest (1993–1995) and graduated from the U.S. War College in 2006.\r\n\r\nHis military career spans over three decades, progressing from platoon leader to brigade commander, and later to top leadership positions within the Romanian Armed Forces. He served in multiple international missions, including UNAVEM III in Angola (1996), ENDURING FREEDOM in Afghanistan (2002–2003), and ANTICA BABILONIA in Iraq (2004) as Battalion Commander.\r\n\r\nIn 2011, he was appointed Commander of the 2nd Infantry Division, followed by leadership of the Romanian Land Forces Staff in 2014. Later that year, he became Deputy Chief of Defence Staff and served as Chief of Defence (2015–2019), the highest military position in Romania. He was Minister of National Defence from November 2019 to December 2021.\r\n\r\nAppointed Prime Minister in December 2021, he led the Romanian Government until June 2023. He then served as President of the Romanian Senate until December 2024.\r\n\r\nThroughout his career, General (Ret.) Ciucă completed several prestigious courses, including the Peacekeeping Operations Instructor Course (Turkey), Joint and Multinational Operations Course, and Civil Military Cooperation training (USA). He also participated in numerous multinational exercises such as Blue Danube 2000, ISAF 2003, and Eurasian Star 2010.\r\n\r\nHis service has been recognized with high-level honors, including the National Order of Merit (Officer and Knight), the UN Medal for UNAVEM III, the French National Order of Merit (Commander), the U.S. Medal of Merit, and the Medal of Honor from the U.S. Special Operations Forces.\r\n\r\nHe speaks English fluently, is married, and has one son."
  },
  {
    "name": "General Songwit Noonpakdee",
    "title": "Chief of Defense",
    "company": "Thailand",
    "bio": "General Songwit Noonpackdee is the 35th Chief of Defence Forces. A native of Bangkok, he is a graduate of Chulalongkorn University Demonstration Secondary School, the Armed Forces Academies Preparatory School, Thailand (AF Class 24) and the Virginia Military Institute, USA (VMI Class of 1988).\r\n\r\nHe has completed several courses, such as the Queen’s Tiger Soldiers Course, the Counter-Terrorism Course, and the Officers Royal Guard Course from King’s Bodyguard School (Class 11/60). He is also a graduate of 2 professional military education courses from the Command and General Staff College (Class 75) and Thailand’s National Defense College (Class 62) in 1997 and 2019 respectively. He received his Master Degree of Science in Civil Engineering from the Florida Institute of Technology and the United States Army Command and General Staff College at Fort Leavenworth, where he was inducted to the International Hall of Fame in 2024. He is a graduate of Airborne School, Pathfinder School, and Ranger School at Fort Benning. He also successfully completed the VIP Protection course from US Diplomatic Security Service. \r\n\r\nGeneral Songwit was commissioned from VMI as an infantry officer. His first assignment was Platoon Leader of the 3rd LRRP Company, 3rd Infantry Division in Nakhon Ratchasima Province, followed by Operations Officer for the 1st LRRP Company, 1st Division, King’s Guard. He, then, served as Heavy Mortar Company Commander for the 21st Infantry Regiment, Queen’s Guard. Following that, he was an instructor at the Command and General Staff College in 1996. \r\n\r\nGeneral Songwit’s command assignments were mainly in the 11th Infantry Regiment, King’s Guard, 1st Division, King’s Guard in Bangkok as Commander of 3rd Infantry Battalion, Commander of 2nd Infantry Battalion. In 2011, he was the Commander of 11th Infantry Regiment, King’s Guard. His senior command assignments were at the 1st Division, King’s Guard as Chief of Staff and Commanding General of the 1st Division, King’s Guard in 2018. He also served as the Commanding General of 11th Infantry Division in 2017, which marked the beginning of an era of the Stryker Division in the Royal Thai Army. \r\n\r\nHis key staff assignments were Deputy Commanding General of the 1st Army Area in 2019, Deputy Chief of Staff (Operations) of the Royal Thai Army, then Royal Thai Army was Chief of the Staff Officers to the Commander-in-Chief. \r\n\r\nIn October 2023, General Songwit assumed command as the 35th Chief of Defence Forces."
  },
  {
    "name": "Colonel T. Justin Bronder",
    "title": "Program Executive Officer, PEO Fixed Wing Programs",
    "company": "U.S. Special Operations Command",
    "bio": "Col Bronder is currently serving as the Program Executive Officer (PEO) for Fixed Wing Programs, HQ Special Operations Command (USSOCOM). He is responsible for developing, producing, testing, modifying, fielding and supporting Special Operations Forces (SOF)-unique fixed wing aircraft and sub-systems. This diverse, $2 billion annual portfolio includes over 100 programs and projects, furnishing SOF-unique aviation capabilities such as the AC-130 and MC-130 variants, OA-1K, MQ-1C, MQ-9, CV-22, U-28, MC-12, C-145, C-146 and an array of remotely piloted vehicles and precision guided munitions.\r\n\r\nA 2003 Air Force Academy distinguished graduate, Justin earned the Holaday Scholarship and completed a Doctorate in Astrophysics at Oxford University before serving at the Air Force Research Laboratory. He then qualified as a flight test engineer, graduating the USAF Test Pilot School with distinction in 2011, and served at the 413th Flight Test Squadron, Hurlburt Field, FL, leading test programs on the CV-22 and several C-130 variants. After selection as an Olmsted Scholar in 2013, Lt Col Bronder spent two years in Poland, where he earned a Doctorate in Military History at Adam Mickiewicz University. Returning to the U.S., he worked as a deputy program manager for the UH-1N replacement program before being selected as a Materiel Leader for the Nuclear Treaty Monitoring Systems Division at the Air Force Technical Applications Center, FL. He is also a distinguished graduate and Traeger Award winner from National War College and deployed in 2008 in support of U.S. Special Operations Command. He most recently served as a Military Assistant to the Under Secretary of Defense for Acquisition and Sustainment (A&S) and as a Deputy Division Chief for Strategic Deterrence and Capabilities in the Office of the Under Secretary of Defense for Acquisition and Sustainment, Strategic, Space and Intelligence Portfolio Management."
  },
  {
    "name": "Mr. Howard Strahan",
    "title": "Deputy Director, SOF AT&L Science and Technology Directorate",
    "company": "United States Special Operations Command",
    "bio": "Mr. Howard Strahan Jr. is the Deputy Director, SOF AT&L Science and Technology Directorate for the United States Special Operations Command (USSOCOM), MacDill Air Force Base, Florida. He is responsible for supporting the Director in the execution of Command Research and Development activities and has over 30 years of Federal Service.\r\n\r\nMr. Strahan’s career began in 1989 designing Signal Intelligence (SIGINT), Communication Jamming Trainers, and Communication Security (COMSEC) platforms for the United States Air Force Air Intelligence Agency. He then worked in Europe conducting open-source science and technology reporting for the United States Army Materiel Command, Science and Technology Center – Europe. He was the Technical Director of the Consolidated SIGINT Support Activity (CSSA) and served as the Program Manager for the Airborne and Ground Support Depot for the Air Force Technical Applications Center (AFTAC).\r\n\r\nMr. Strahan was later promoted to Chief Engineer for the 77 Aeronautical Systems Group, 77 Aeronautical Systems Wing, providing technical oversight and having Operational Suitability, Safety, and Effectiveness (OSS&E) responsibility for the development and sustainment of all USAF Aircrew Protection Equipment, Aeromedical Evacuation Equipment, and Chemical/Biological Defense Equipment.\r\n\r\nIn 2008, Mr. Strahan transitioned to MacDill AFB, Florida, with USSOCOM SOAL–T (now known as SOF AT&L-ST), where he executed BA2 and BA3 funds in support of biomedical, optics, and weapons research. This led to his role as Strategic Engagement Lead for SOF AT&L-ST, where he provided outreach to outside agencies and discovery support for Applied Research and Advanced Technology Development funding aimed at addressing USSOCOM capability gaps. He has also provided technical leadership to the programs executing in these critical areas.\r\n\r\nMr. Strahan holds a Master’s of National Security and Strategic Studies from the United States Naval War College, a Master’s of Business Administration in Aerospace Defense from the University of Tennessee, and a Bachelor of Science in Mechanical Engineering from Texas A&M University. He is Level III acquisition certified in Systems Planning, Research, Development, and Engineering and is a current member of the Air Force Acquisition Corps."
  },
  {
    "name": "Sergeant Major (Ret.) Matt Parrish",
    "title": "Executive Director, Task Force Dagger Foundation",
    "company": "Host, USSOCOM's official podcast - SOFcast",
    "bio": "Matt is a retired Green Beret who spent his entire 20-year career within Special Operations, including 13 years on Army Special Forces operational teams. He completed multiple combat tours to Iraq and Afghanistan as well as training and operational tours to most of the countries in Central and South America. He’s the recipient of numerous leadership awards, service medals, and specialized certifications in some of the world’s toughest disciplines. He rose to the highest enlisted rank in the U.S. Army and his final position was the Senior Enlisted Leader for the USSOCOM Preservation of the Force and Family program – overseeing human performance and wellness for over 70k special ops individuals across the globe.\r\n\r\nMatt has also narrated and performed across the country at college and professional sporting events with the SOCOM Para-Commando parachute demonstration team and he created and hosted SOCOM’s first official podcast, SOFcast. He’s recently created a new podcast called Prep For Impact that highlights authentic conversations with high achievers across special ops, sports, business, non-profit and other impactful careers. Matt also uses his popular military humor Instagram page, Another_SF_meme_page to raise money and awareness for veteran and military charities and causes. He’s a frequent guest on podcasts, radio shows, and speaking engagements.\r\n\r\nMatt has been married for over 16 years, has three children, is hopelessly addicted to golf, and believes fervently in Philippians 4:13."
  },
  {
    "name": "Sergeant Major Thomas P. Payne",
    "title": "Medal of Honor Recipient",
    "company": "Congressional Medal of Honor Society",
    "bio": "Sergeant First Class Thomas P. Payne distinguished himself by extraordinary gallantry and heroism above and beyond the call of duty during a daring nighttime hostage rescue on October 22, 2015, in Kirkuk Province, Iraq, in support of Operation INHERENT RESOLVE. Leading a combined assault team, Sergeant Payne swiftly cleared one building, freeing 38 hostages. Upon hearing calls for assistance at the second building under heavy enemy fire, he voluntarily crossed the open compound under fire to aid the assault.\r\n\r\nClimbing onto the burning roof, Sergeant Payne engaged enemy fighters with grenades and small arms fire, then moved to ground level, firing through a breach to suppress resistance. With time running out and the building engulfed in flames, he courageously entered through heavy gunfire, locating the armored door imprisoning the hostages. After exiting to retrieve bolt cutters, he reentered under enemy fire to cut the locks. His actions inspired other coalition members to join the effort.\r\n\r\nDespite orders to evacuate the collapsing building, Sergeant Payne reentered multiple times to ensure no one was left behind, facilitating the release and evacuation of 37 additional hostages. Throughout the operation, he repeatedly exposed himself to intense enemy fire, smoke, and structural collapse. His heroism directly contributed to the liberation of 75 hostages and the elimination of 20 enemy combatants.\r\n\r\nSergeant First Class Payne’s selfless actions, bravery under fire, and unwavering commitment to mission success uphold the highest traditions of military service and reflect immense credit upon himself, the United States Special Operations Command, and the United States Army."
  },
  {
    "name": "Master Sergeant Earl D. Plumlee",
    "title": "Medal of Honor Recipient",
    "company": "Congressional Medal of Honor Society",
    "bio": "Staff Sergeant Earl D. Plumlee distinguished himself by extraordinary gallantry above and beyond the call of duty on August 28, 2013, while serving as a weapons sergeant with C Company, 4th Battalion, 1st Special Forces Group (Airborne) in support of Operation Enduring Freedom. When insurgents detonated an explosion that created a 60-foot breach in Forward Operating Base Ghazni's perimeter, ten enemy fighters wearing Afghan National Army uniforms and suicide vests poured through.\r\n\r\nSergeant Plumlee and five others rushed toward the breach in two vehicles. Under enemy fire, Plumlee shielded his driver with his body before exiting and engaging an insurgent 15 meters away with his pistol. Without cover and at great personal risk, he advanced on and engaged multiple insurgents, killing two—one with a grenade and another by detonating his suicide vest with precision sniper fire.\r\n\r\nDespite intense fire, Sergeant Plumlee repeatedly advanced against enemy forces, engaging insurgents at close range, even after a suicide vest exploded within seven meters, throwing him against a wall. Ignoring his injuries, he reengaged the enemy alongside another soldier. When enemy fire forced a brief withdrawal, Sergeant Plumlee joined a group of American and Polish soldiers to launch another counterattack.\r\n\r\nDuring the renewed assault, Plumlee engaged multiple insurgents, including one who detonated his vest, fatally wounding a U.S. soldier. Plumlee ran to the wounded soldier, carried him to safety, rendered first aid, and remained on security to clear the area of further threats.\r\n\r\nStaff Sergeant Plumlee’s remarkable bravery, disregard for his own safety, and decisive actions were instrumental in repelling the attack and saving lives. His actions reflect great credit upon himself, the Special Forces Regiment, and the United States Army."
  },
  {
    "name": "Master Sergeant Matthew O. Williams",
    "title": "Medal of Honor Recipient",
    "company": "Congressional Medal of Honor Society",
    "bio": "Sergeant Matthew O. Williams distinguished himself by acts of gallantry and intrepidity above and beyond the call of duty on April 6, 2008, while serving as a Weapons Sergeant with Special Forces Operational Detachment Alpha 3336, Special Operations Task Force-33, in Afghanistan. Inserted by helicopter, Sergeant Williams’ assault element came under intense enemy machine gun, sniper, and rocket-propelled grenade fire while ascending a mountain toward its objective. The lead element, including the ground commander, sustained casualties and was pinned down on the mountainside.\r\n\r\nUpon learning of the situation, Sergeant Williams braved heavy fire to lead a counterattack across a valley filled with ice-covered boulders and a waist-deep, freezing river. Reaching the pinned-down element, he organized Afghan commandos to deliver suppressive fire, preventing enemy overrunning of the position. When the Team Sergeant was wounded, Williams exposed himself to enemy fire to render aid and move him down the steep terrain to a casualty collection point.\r\n\r\nDespite danger, Sergeant Williams climbed back up the mountain to help defend the assault element, reestablished critical satellite communications under fire, and assisted in moving additional wounded soldiers to safety. As enemy forces threatened the casualty collection point, Williams led a counterattack that held off the insurgents for hours.\r\n\r\nWhen evacuation helicopters arrived, Sergeant Williams repeatedly exposed himself to enemy fire to carry and load the wounded onto the aircraft, all while directing fire to suppress enemy positions. His courageous actions enabled the successful evacuation of wounded and fallen comrades without further loss of life. Sergeant Williams’ extraordinary bravery, selflessness, and leadership under fire were pivotal in saving the lives of four critically wounded soldiers and preventing the assault element from being overrun.\r\n\r\nHis actions reflect great credit upon himself, the Combined Joint Special Operations Task Force-Afghanistan, Special Operations Command Central, and the United States Army."
  },
  {
    "name": "Colonel Rhea Pritchett",
    "title": "Program Executive Officer, PEO SOF Digital Applications (SDA), SOF AT&L",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Colonel Christopher Paone",
    "title": "J4 Logistics Directorate",
    "company": "U.S. Special Operations Command",
    "bio": "Colonel Christopher L. Paone serves as the Director of Logistics (J4) at U.S. Special Operations Command (USSOCOM), overseeing operational logistics support for Special Operations Forces (SOF) worldwide. His responsibilities include materiel management, cataloging, provisioning, and fielding Special Operations-peculiar equipment.\r\n\r\nPrior to this role, Colonel Paone commanded the 10th Support Group at Torii Station, Okinawa. He previously led the Group Support Battalion, 3rd Special Forces Group (Airborne) at Fort Bragg (2015–2017), and later served at the Combined Arms Support Command (Fort Lee, Virginia) and Army Sustainment Command (Rock Island Arsenal).\r\n\r\nA native of Ramsey, New Jersey, Colonel Paone commissioned into the Quartermaster Corps through the Providence College ROTC program. Early assignments included Platoon Leader, Company Executive Officer, and Petroleum Operations Officer with the 260th Quartermaster Battalion at Hunter Army Airfield, Georgia, and service in Bosnia/Herzegovina with the 148th Logistics Task Force.\r\n\r\nFrom 2003–2014, he held key logistics roles at Fort Bragg, including Group Assistant S4 and Service Detachment Commander with the 7th Special Forces Group (Airborne); Services Officer in the 82nd Airborne Division; and Group S4 for 7th SFG (A). He also served as Aide-de-Camp at the U.S. Army War College, and as Logistics Coordinator for the Armed Forces Inauguration Committee during a presidential inauguration.\r\n\r\nColonel Paone later served as an Interagency Fellow at FEMA in Washington, D.C., and as National Programs and Employment Director for the Soldier For Life Program on the Army Staff. He deployed multiple times to Afghanistan in support of the Combined Joint Special Operations Task Force and Combined Joint Task Force-82.\r\n\r\nColonel Paone holds a Bachelor of Science in Business Administration from Providence College, and master’s degrees in Business Administration (University of Maryland University College), Logistics Management (Florida Institute of Technology), and Strategic Studies (U.S. Army War College).\r\n\r\nHe is married and has two children."
  },
  {
    "name": "Colonel Stephen Murphy",
    "title": "Command Engineer",
    "company": "Headquarters, U.S. Special Operations Command",
    "bio": "Col. Stephen F. Murphy has served as the USSOCOM Command Engineer since October 2022, advising the Commander on construction, facilities, and engineering matters. He represents USSOCOM to the Department of Defense, Services, Combatant Commands, Interagency, and Congress, and oversees operational engineering support for SOF components and a $4 billion military construction program at MacDill AFB.\r\n\r\nWith over 26 years of experience across the USSOCOM enterprise, Col. Murphy has held key engineering roles at JSOC, USASOAC, and 3rd Special Forces Group (Airborne), among others. He deployed three times to Afghanistan and once to Iraq, serving notably as the J-7 Engineer for CJSOTF-A.\r\n\r\nHe has commanded at all levels, including as District Commander of the USACE New Orleans District (2019–2022) and the USACE Nashville District (2015–2017). His earlier assignments include the 20th Engineer Battalion, 2nd Infantry Division in Korea, the 307th Engineer Battalion, and the 2/2 Stryker Brigade Combat Team at Joint Base Lewis-McChord. His humanitarian missions include deployments to Bosnia-Herzegovina, Hurricane Katrina recovery efforts, and forest firefighting in Montana.\r\n\r\nCol. Murphy holds a Bachelor of Science in Civil Engineering from the Illinois Institute of Technology, a Master of Science in Civil Engineering from Missouri University of Science and Technology, and a Master of Arts in Strategy from the U.S. Army War College.\r\n\r\nHe is a graduate of the U.S. Army War College, U.S. Marine Corps Command and Staff College, and multiple Army Engineer courses. His military qualifications include the Ranger Tab, Sapper Tab, Master Parachutist Badge, and Combat Action Badge.\r\n\r\nHis awards include the Legion of Merit, Bronze Star Medal (with two oak leaf clusters), Defense Meritorious Service Medal (with one oak leaf cluster), Army Meritorious Service Medal (five oak leaf clusters), and NATO medals for Bosnia and Afghanistan, among others. He is also a recipient of the Army Engineer Association’s Silver and Bronze de Fleury Medals.\r\n\r\nCol. Murphy is married to Nicole, and together they have two teenage children, Will and Claire."
  },
  {
    "name": "Colonel Ramsey Oliver",
    "title": "Program Executive Officer SOF Warrior Systems",
    "company": "U.S. Special Operations Command",
    "bio": "Colonel R. Ramsey Oliver is a native of Albany, Georgia, and a 2002 Distinguished Military Graduate of North Georgia College & State University in Dahlonega, where he earned a Bachelor of Business Administration in Finance.  Upon graduation, he commissioned as a Second Lieutenant in the Finance Corps with a branch detail assignment to the Infantry.  In July 2010, he transitioned to the U.S. Army Acquisition Corps.  \r\nCOL Oliver is currently the Program Executive Officer for Special Operations Forces Warrior Systems (PEO-SW) at USSOCOM where he is responsible for management, direction, and guidance for the planning, development, acquisition, testing, & product improvement of technologies and equipment that place critical capabilities in the hands of special operators.  He oversees an annual $1.6B portfolio with 10 program management offices dispersed across the United States.  Previous USSOCOM assignments include the Director of Test & Evaluation & the Program Manager for USSOCOM’s Counter Proliferation Office in PEO-SW.  \r\nHis other previous acquisition assignments include Contract Management Officer, 708th Contingency Contracting Team; Deputy Chief, Regional Contracting Center Jalalabad, Afghanistan; Chief of Current Operations, U.S. Central Command Joint Theater Contracting Support Command, Camp As Sayliyah, Qatar; Career Manager for Acquisition Management Branch, Human Resources Command, Fort Knox, Kentucky; Assistant Product Manager in Soldier Maneuver Sensors, Soldier Sensors & Lasers, Program Executive Office Soldier, Fort Belvoir, Virginia; Executive Officer to the Principal Military Deputy to the Assistant Secretary of the Army (Acquisition, Logistics & Technology), Pentagon, Washington, DC.   \r\nCOL Oliver has completed an Operation Enduring Freedom tour & two Operation Iraqi Freedom tours. He earned a Master’s in Strategic Studies from Air University at Maxwell Air Force Base, AL & a Master of Business Administration from Webster University in Saint Louis, Missouri.  His military education includes the Infantry Officer Basic Course, Mechanized Leaders Course, Modern Army Combatives Instructor Course, Antiterrorism/Force Protection Level II Training Course, Finance Officer Advanced Course, Planning Programming Budgeting and Execution Systems Course, Resource Management Tactical Course, Comptrollers Accreditation & Fiscal Law Course, Army Acquisition Basic Course, Intermediate Program Manager & Contracting Courses, Command & General Staff Coll"
  },
  {
    "name": "Mr. Colby Jenkins",
    "title": "Assistant Secretary of Defense for Special Operations Low Intensity Conflict (Acting)",
    "company": "U.S. Department of Defense",
    "bio": "Mr. Colby Jenkins is an Army Special Forces combat veteran and currently is performing the duties of Assistant Secretary of Defense for Special Operations and Low Intensity Conflict. Colby was previous appointed as the Deputy Assistant Secretary of Defense for Irregular Warfare and Counterterrorism in the Office of the Secretary of Defense.\r\n\r\nUpon graduating from West Point, Colby became an airborne Ranger-qualified infantry officer before trying out for and being selected to become a Special Forces officer. As a Green Beret Detachment Commander, Colby led his Special Forces A-team on multiple global deployments, including combat in Afghanistan and later various training, counter-drug, and hostage rescue operations throughout South America, including the jungles of Colombia.\r\n\r\nColby’s experience in combat and leading his team opened new opportunities to serve beyond the fields of battle. The four-star commanding general of the United States Special Operations Command (USSOCOM) hand-selected Colby to initiate a new congressional fellowship program that included graduate school in Washington, D.C., and working in a U.S. Senator’s office. Colby would be the first special operations officer to do so for USSOCOM, creating a path for many others to follow. After Colby’s work in the U.S. Senate and completing graduate school, Colby continued his work on Capitol Hill as a Green Beret liaison to Congress. This experience took him from the halls of Congress around the world with members of Congress and staff. Colby later worked in the Pentagon as a counterterrorism policy advisor to the Secretary of Defense, coordinating critical efforts between the White House, Pentagon, Capitol Hill, and other interagency partners to advance American interests.\r\n\r\nAfter completing his active-duty military service Colby transitioned to the Army National Guard and now the Army Reserves where he continued his military service for more than two decades. During his civilian career, Colby remained active in the legislative arena working for several years in the Pentagon as the senior civilian legislative strategic advisor to the Vice-Chairman of the Joint Chiefs of Staff, the nation’s #2 military leader."
  },
  {
    "name": "Dr. Lyla Kohistany",
    "title": "CEO, Honor the Promise;",
    "company": "GSOF Advisory Council",
    "bio": "Lyla is an Afghan refugee, U.S. Navy veteran (Surface Warfare & Intelligence), entrepreneur, organizational enhancer, and innovation igniter. With three Afghanistan deployments alongside U.S./NATO Special Operations Forces (SOF) and tours in the Pentagon, she has enjoyed a distinguished career contributing to counterterrorism, counterinsurgency, and all-source intelligence operations.\r\n\r\nLyla is also a lauded corporate educator, having designed and facilitated hundreds of interactive/experiential programs on cultural intelligence, organizational performance, innovation, and inspirational leadership. She is a sought-after speaker and moderator, has been featured in various media, and contributed to numerous podcasts. She also co-founded two nationwide nonprofits, PROMOTE Leadership and Honor the Promise.\r\n\r\nLyla was a Scholar at the George W. Bush Presidential Center and a nonresident Senior Fellow at The Atlantic Council. She also served on the Board of Directors for The Honor Foundation. She is currently a Senior Fellow with The Soufan Center, an Ambassador for the Global War on Terrorism Memorial Foundation, a member of the Global SOF Foundation’s Advisory Council, and on the Board of Directors for the Corioli Institute.\r\n\r\nLyla earned a Doctor of Education (EdD) in Leadership and Innovation from Arizona State University. She is a Star Trek and Star Wars aficionada, international traveler, and devoted aunt to her niece and nephews."
  },
  {
    "name": "Mr. Troy Hepp",
    "title": "Program Manager, PEO Services",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Khalia Williams",
    "title": "Program Manager, PEO Services",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Colonel Naoto Kuwahara",
    "title": "Commander",
    "company": "Japan Special Operations Group",
    "bio": "Colonel Kuwahara serves as the 8th Commanding Officer of the Special Operations Group, representing the Japanese Special Forces and bringing a distinct perspective on military operations. With an esteemed career encompassing various international and domestic assignments, Colonel Kuwahara has demonstrated exceptional leadership and operational expertise.\r\n\r\nHe will provide valuable insights into regional security challenges which Japan faces to Russia and PRC, the role of the Japanese military in addressing these issues within the maritime domain, and the operational dynamics of Special Operations Forces (SOF) in the Indo-Pacific region. Additionally, Colonel Kuwahara will outline his vision for establishing a SOF network in the Asia-Pacific, promoting cooperation and collaboration among allied nations."
  },
  {
    "name": "Lieutenant Commander Roxana Alexandru",
    "title": "",
    "company": "Romania",
    "bio": "LTCDR Roxana Alexandru is a naval engineer with a 20 years’ experience as a military officer. She started her career being appointed as a navigation officer onboard Romanian minesweepers and afterwards on the type 22 frigates, participating in various NATO and allied exercises and missions, including the first and only NATO Article 5 activation which happened after 9/11 attacks, maritime operation Active Endeavour in the eastern Mediterranean Sea.\r\n\r\nAfter graduating the Joint Command Master’s program at the Romanian National Defense University, in 2022, she was appointed in the Romanian Ministry of Defense and currently she serves as the Romanian liaison officer to US CENTCOM."
  },
  {
    "name": "Mr. Jonas Kjellèn",
    "title": "Swedish Defence Research Agency",
    "company": "",
    "bio": ""
  },
  {
    "name": "Commander Mike Ameche",
    "title": "Director of Leadership Development & Assessment",
    "company": "U.S. Naval Special Warfare Command",
    "bio": "CDR Mike Ameche is the current NSW Director of Leadership Development & Assessment, and represents Naval Special Warfare Command and the United States. \r\n\r\nThe Commander has 24 years of special operations experience spanning several maritime environments and threats including the Middle East, Indo-Pacific, and Homeland.  His operational tours include SEAL Team THREE, SEAL Team SEVEN, SEAL Team FIVE, and Special Reconnaissance Team ONE.  Staff and education tours include Special Operations Command NORTH and the Naval Postgraduate School."
  },
  {
    "name": "Lieutenant Commander Luca Meca",
    "title": "Navy Special Operations Forces",
    "company": "Italy",
    "bio": "LCDR Meca serves as head of the R&A office of the ITA NAVY SOF - Gruppo Operativo Incursori (GOI). \r\nHe completed Italian SEAL training, earning the corresponding qualification and joining the GOI, the Italian Navy’s Special Forces unit. Established in 1952, GOI is the successor to Italy’s wartime assault craft units and frogman of the Second World War. \r\nLuca has operational experience in both national and multinational contexts, in Italy and overseas, working closely with other Italian Special Forces as well as allied and partner units. In  2012, he completed a one-year exchange programme in Virgina, USA, with NSWG2.\r\nHis background will provide valuable insights into the challenges that such regions is facing in terms of Special Ops and about the posture of the Italian Special Forces are having in relations to it."
  },
  {
    "name": "Dr. Seth Jones",
    "title": "President, Defense and Security Department; Harold Brown Chair",
    "company": "Center for Strategic and International",
    "bio": "Seth G. Jones is president of the Defense and Security Department and Harold Brown Chair at the Center for Strategic and International Studies (CSIS). He focuses on defense strategy, military operations, force posture, and irregular warfare. He leads a bipartisan team of over 50 resident staff and an extensive network of non-resident affiliates dedicated to providing independent strategic insights and policy solutions that shape national security. He also teaches at Johns Hopkins University’s School of Advanced International Studies (SAIS) and the Center for Homeland Defense and Security (CHDS) at the U.S. Naval Postgraduate School.\r\n\r\nPrior to joining CSIS, Dr. Jones was the director of the International Security and Defense Policy Center at the RAND Corporation. He also served as representative for the commander, U.S. Special Operations Command, to the assistant secretary of defense for special operations. Before that, he was a plans officer and adviser to the commanding general, U.S. Special Operations Forces, in Afghanistan (Combined Forces Special Operations Component Command–Afghanistan). In 2014, Dr. Jones served on a congressionally mandated panel that reviewed the FBI’s implementation of counterterrorism recommendations contained in the 9/11 Commission Report. He is the author of Three Dangerous Men: Russia, China, Iran, and the Rise of Irregular Warfare (W.W. Norton, 2021), A Covert Action: Reagan, the CIA, and the Cold War Struggle in Poland (W.W. Norton, 2018), Waging Insurgent Warfare: Lessons from the Vietcong to the Islamic State (Oxford University Press, 2016), Hunting in the Shadows: The Pursuit of al Qa'ida since 9/11 (W.W. Norton, 2012), and In the Graveyard of Empires: America’s War in Afghanistan (W.W. Norton, 2009). Dr. Jones has published articles in a range of journals, such as Foreign Affairs, Foreign Policy, and International Security, as well as newspapers and magazines like the New York Times, Washington Post, and Wall Street Journal. Dr. Jones is a graduate of Bowdoin College and received his MA and PhD from the University of Chicago."
  },
  {
    "name": "Ms. Katherine Boyle",
    "title": "General Partner",
    "company": "Andreessen Horowitz",
    "bio": "Katherine Boyle is a General Partner at Andreessen Horowitz and cofounder of the firm’s American Dynamism practice, which invests in companies supporting the national interest across aerospace, defense, manufacturing, energy, logistics, and critical infrastructure. She sits on the boards of Apex Space and Hadrian Automation and is a board observer for Saronic Technologies and Castelion.\r\n\r\nShe was previously a partner at General Catalyst, where she co-led the firm’s seed practice and invested in the inception rounds of defense technology companies including Anduril Industries and Vannevar Labs. Prior to General Catalyst, she was a general assignment reporter at The Washington Post. Katherine holds a BA in Government from Georgetown University, an MBA from Stanford and a Masters of Public Advocacy from the National University of Ireland, Galway.\r\n\r\nKatherine believes that free speech is essential to promoting American Dynamism. She is a proud champion of new media companies and academic centers that promote free speech and free thought. She serves on the boards of The Free Press and the Mercatus Center at George Mason University."
  },
  {
    "name": "Vice Admiral Frank D. Whitworth",
    "title": "Director",
    "company": "National Geospatial-Intelligence Agency",
    "bio": "Vice Admiral Frank Whitworth is the eighth Director of the National Geospatial-Intelligence Agency. He leads and directs NGA under the authorities of the Secretary of Defense and Director of National Intelligence. He became NGA’s director on June 3, 2022.\r\n\r\nWhitworth is a 1989 graduate of Duke University Durham, North Carolina, with a Bachelor of Arts in Political Science. He holds a Master of Arts in National Security Studies from Georgetown University, Washington, District of Columbia, as well as a diploma from the Naval War College in Newport, Rhode Island.\r\n\r\nWhitworth’s command tours included commander, Joint Intelligence Center Central; commanding officer, Navy Element of U.S. Central Command; and commanding officer, Kennedy Irregular Warfare Center.\r\n\r\nWhitworth’s operational tours included director of Intelligence for The Joint Staff, director of Intelligence for U.S. Africa Command, director of Intelligence for Joint Special Operations Command, director of Intelligence and deputy director of Maritime Operations Center for Commander, U.S. Naval Forces Central Command, U.S. Fifth Fleet; director of Intelligence for a Special Operations Task Force in Afghanistan during three deployments supporting Operation Enduring Freedom; director of Intelligence for Naval Special Warfare Development Group; special assistant for Political-Military Affairs at U.S. Sixth Fleet during Operation Allied Force; indications and warning officer at U.S. Naval Forces Central Command, U.S. Fifth Fleet, in support of Operation Desert Storm; and intelligence officer for Fighter squadron 31 during USS Forrestal’s deployment in support of Operation Provide Comfort.\r\n\r\nWhitworth’s shore-based tours included the National Security Agency, chief of targets for the U.S. Central Command area of responsibility; Navy federal executive fellow to American Enterprise Institute; senior duty officer at the White House Situation Room; intelligence briefer for the Chief of Naval Operations and Secretary of the Navy; and intelligence watch analyst at the Office of Naval Intelligence and the National Military Joint Intelligence Center.\r\n\r\nWhitworth is a member of the Council on Foreign Relations. Some of his decorations include the Defense Superior Service Medal, Legion of Merit, Bronze Star, Defense Meritorious Service Medal, as well as the Edwin T. Layton Leadership Award, Vice Admiral Rufus L. Taylor Leadership Award, the Army’s Knowlton Award for excellence in intelligence."
  },
  {
    "name": "Mr. Matt Higgins",
    "title": "Co-Founder & CEO",
    "company": "RSEVentures",
    "bio": "Matt Higgins is a noted serial entrepreneur, growth equity investor as Co-founder and CEO of private investment firm, RSE Ventures, and Wall Street Journal best-selling author of Burn The Boats.\r\n\r\nHe is also an Executive Fellow at the Harvard Business School where he co-teaches the course “Moving Beyond Direct-to-Consumer.”  Mr. Higgins’ deep operating experience spans multiple industries over his 25-year career, which he draws upon to help founders navigate complex situations in order to reach their full potential.\r\n\r\nMr. Higgins began his career in public service as a journalist before becoming the youngest mayoral press secretary in New York City at 26, where he managed the global media response to the September 11, 2001 terrorist attacks. He became one of the first employees – and ultimately Chief Operating Officer – of the Lower Manhattan Development Corporation, the federally funded government agency created to plan the rebuilding of the World Trade Center site. Mr. Higgins helped organize the largest international design competition in history culminating in Reflecting Absence, the September 11th National Memorial, and the development of the 1,776-feet-tall One World Trade Center, the tallest building in the northern hemisphere.\r\n\r\nAfter transitioning to the private sector, Mr. Higgins spent 15 years in senior leadership positions with National Football League teams. He made his mark with two NFL franchises, overseeing the revenue functions of the New York Jets as Executive Vice President of Business Operations, and after leaving the Jets, serving as Vice Chairman of the Miami Dolphins from 2012 – 2021. Higgins co-founded New York City-based RSE Ventures in 2012, amassing a multi-billion-dollar investment portfolio of leading brands across sports and entertainment, media and marketing, consumer and technology industries – including several of Fast Company’s Most Innovative Companies."
  },
  {
    "name": "Mr. John Ridge CBE",
    "title": "Chief Adoption Officer",
    "company": "NATO Innovation Fund",
    "bio": "After completing his Architectural Engineering degree in 1995, John joined the Royal Engineers. He completed tours with Commandos and Gurkhas, deploying to Northern Ireland, Norway, Oman, Kosovo and Bosnia. He later commanded a bomb disposal squadron and a close support engineer regiment, including three tours of Helmand Province, Afghanistan. His staff tours included two years as a Military Assistant, a tour developing the UK's offensive counter-IED strategy and time as the Army Pay Colonel. After attending Higher Command and Staff Course (HCSC), he took command of 8 Engineer Brigade, after which he was appointed Chief of Joint Force Operations, a tour which included deploying as the Joint Task Force Commander for the UK's crisis response to Hurricanes Irma and Maria.\r\n\r\nJohn left the Army in 2020 to join the Civil Service. He spent two years as Director Strategy and Enterprise Services in Defence Intelligence where he led transformation and corporate services. In March 2022, he moved to 10 Downing Street on a six-month loan, leading transformation and working as part of a broader Cabinet Office change programme. He returned to MOD in September 2022 as Director Defence Innovation where he led Defence's innovation portfolio, including being the UK representative on the NATO DIANA Board of Directors and leading the Innovation Working Group in AUKUS Pillar 2. After just over two years in this post, John left government for the first time to join the NATO Innovation Fund as their first Chief Adoption Officer."
  },
  {
    "name": "Mr. Gabriel Ramos",
    "title": "Deputy Director, Operations Division",
    "company": "Irregular Warfare Technical Support Directorate",
    "bio": ""
  },
  {
    "name": "Dr. Steven A. Smith",
    "title": "Director Special Programs (Aviation); U.S. Army Aviation and Missile Command",
    "company": "Program Executive Officer Rotary Wing, U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Colonel Mark Cleary",
    "title": "Project Manager, Technology Applications Program Office",
    "company": "U.S. Special Operations Command",
    "bio": "COL Mark Cleary was commissioned as a Second Lieutenant in 2003 in the U.S. Army Aviation branch. He earned a Bachelor of Science in Aerospace Engineering from Embry-Riddle Aeronautical University and began his career at Fort Rucker with the 1st Battalion, 145th Aviation Regiment. His first operational assignment was flying OH-58D Kiowa Warrior helicopters in the 1st Battalion, 82nd Aviation Brigade, later reflagged as the 1st Squadron, 17th Cavalry Regiment, where he served as a Platoon Leader and Assistant Operations Officer, deploying in support of Operation Iraqi Freedom.\r\n\r\nAfter completing the Aviation Captain’s Career Course, COL Cleary was selected for the 160th Special Operations Aviation Regiment (SOAR) (Airborne). He completed SERE training, the CH-47D Chinook qualification course, and MH-47G Officer Green Platoon before joining the 3rd Battalion, 160th SOAR (A) as a Platoon Leader. He conducted multiple deployments in Operation Enduring Freedom as a Fully Mission Qualified Pilot in Command and Officer in Charge. He later commanded Company B, 1st Battalion, 228th Aviation Regiment at Soto Cano Airbase, Honduras.\r\n\r\nFollowing command, he attended Army Acquisition Courses, the Fixed Wing Multi-Engine Qualification Course, U.S. Naval Test Pilot School, and Command and General Staff College. He then transitioned into acquisition roles, serving as an Experimental Test Pilot (XP) at the Aviation Applied Technology Directorate (AATD). He is DAWIA-certified in Program Management (Advanced) and Test & Evaluation (Practitioner) and holds a Master of Science in Engineering Systems from the Naval Postgraduate School.\r\n\r\nHis acquisition assignments include Assistant Program Manager/XP at the Aviation Integration Directorate, Team Lead/XP for the Rotorcraft In-Flight Laboratory, Product Manager for the MH-47G at the Technology Applications Program Office (TAPO), Chief of Aviation Experimentation/XP at the Technology Development Directorate-Aviation, and TAPO Project Manager.\r\n\r\nCOL Cleary is qualified in multiple aircraft, including the OH-58A/C/D, CH-47D/F, MH-47G, H-60A/L/M, UH-72, C-12, and T-34C. His military awards and decorations reflect his distinguished career.\r\n\r\nHe and his wife, Stephanie, are proud parents of two children, Peyton (16) and William (12)."
  },
  {
    "name": "Lieutenant Colonel Thomas Brewington",
    "title": "Product Manager, MH-47",
    "company": "U.S. Special Operations Command",
    "bio": "Commissioned as an Aviation Officer in 2004, Tom completed nine years of aviation service in a wide range of operational aviation assignments from platoon to brigade level in the 12th Combat Aviation Brigade and 101st Combat Aviation Brigade and deployed twice in support of the Global War on Terrorism. After joining the Army Acquisition Corps in 2013, Tom served as the Branch Chief for Aircraft Survivability Equipment (ASE) under TRADOC Program Office – Aviation Brigades (TPO–AB), responsible for the development and staffing of critical ASE requirement documents.\r\n\r\nTom completed his key developmental acquisition assignment in PEO Intelligence, Electronic Warfare and Sensors (IEW&S) as the Assistant Product Manager, Army Tactical Exploration of National Capabilities (TENCAP), where he supported the development of counter-unmanned aircraft system (C-UAS) capabilities in support of CENTCOM joint-urgent operational requirements. To further broaden his skillset, Tom served on the Army Special Operations Aviation Command (ARSOAC) Headquarters staff assigned to the G-8 Directorate, where he provided acquisition expertise in support of resource development and requirements generation/validation.\r\n\r\nPrior to joining TAPO as the MH-47G Product Manager, Tom served as both Assistant Product Lead and eventually Product Lead for the Scout/Attack portfolio under the Multi-National Aviation Special Project Office (MASPO), PEO-Aviation, where he led a team of acquisition professionals responsible for providing global non-standard rotary wing support through Foreign Military Sales.\r\n\r\nTom grew up in Pembroke, North Carolina, where he earned a Bachelor of Science in Business Administration and received his commission in the Reserve Officers’ Training Corps. Tom is a graduate of the US Army Command and General Staff College and holds a Master of Science in Supply Chain Management and Logistics from The University of Kansas. He is certified Advanced (formerly Level III) in Program Management and is a member of the Army Acquisition Corps.\r\n\r\nLTC Brewington’s military awards and decorations are complementary of a military officer with similar time in grade and experience."
  },
  {
    "name": "Mr. Paul Kylander",
    "title": "Product Manager, A/MH-6 Little Bird",
    "company": "U.S. Special Operations Command",
    "bio": "Mr. Kylander is a distinguished leader in aerospace engineering and program management with over two decades of experience. He holds a Bachelor of Science in Electrical Engineering from the University of Victoria and a Master of Science in Systems Engineering Management from the Naval Postgraduate School. His professional certifications include Level III in Program Management and Engineering, Level I in Information Technology, and a Systems Engineering certificate.\r\n\r\nBeginning his career in 2000 at Rockwell Collins, Mr. Kylander contributed to the development of the Common Avionics Architecture System (CAAS) cockpit, supporting the successful fielding of the MH-47 and MH-60 systems for the 160th Special Operations Aviation Regiment (SOAR). In 2003, he joined Honeywell as lead systems engineer for the EGI+429+JAIC program, helping deliver critical embedded GPS and navigation units for SOAR platforms.\r\n\r\nIn 2006, Mr. Kylander transitioned to the Technology Applications Program Office (TAPO) as a support contractor and later entered government service as an Aerospace Engineer in 2008. During his decade in TAPO's Mission Equipment Avionics office, he oversaw the release of 10 major CAAS software updates and key tactical networking advancements. In 2018, he became Deputy Product Manager for the MH-60 team, successfully managing the delivery of 10 MH-60M aircraft and helping establish TAPO’s Future Vertical Lift office.\r\n\r\nHe returned to the Mission Equipment office as Deputy Product Manager in 2020 before assuming the Charter of the A/MH-6 Office on May 5, 2022. As Product Manager, he has led multiple platform configuration changes and overseen the delivery of over 30 aircraft from multiple production lines, including managing the delivery of the first A/MH-6R, a newly designated variant for the platform.\r\n\r\nThroughout his career, Mr. Kylander has demonstrated exceptional leadership, technical expertise, and a commitment to advancing critical aviation capabilities for the special operations community."
  },
  {
    "name": "Lieutenant Colonel Lev Mazeres",
    "title": "Product Manager, Mission Equipment",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Lieutenant Colonel John Williams",
    "title": "Product Manager, SOF Training Systems",
    "company": "U.S. Special Operations Command",
    "bio": "LTC John M. Williams II is an Army acquisition officer with 20 years of service on active duty. Since transitioning to the Army Acquisition Corps, LTC Williams has led teams in developing, procuring, and fielding advanced virtual training systems; leading science and technology portfolio integration at the DEVCOM Chem Bio Center; and leading a team of science advisors to Army units in the INDO-PACIFIC theater.\r\n\r\nLTC Williams currently serves as Product Manager of Forces Training Systems, where he leads efforts to mature and acquire training solutions for Special Operators, Army Intelligence, and Opposition Forces at combat training centers.\r\n\r\nHe earned a BS in Chemistry from the United States Military Academy, an MA in Leadership from the University of Texas at El Paso, an MS in Biomedical Engineering from the University of North Carolina at Chapel Hill, and a PhD in Material Science from Vanderbilt University."
  },
  {
    "name": "Lieutenant Colonel Cameron Keogh",
    "title": "Product Manager, MH-60/FVL and Launched Effects",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "General Dan Caine",
    "title": "Chairman of the Joint Chiefs of Staff",
    "company": "U.S. Department of Defense",
    "bio": "General Dan Caine is the 22nd Chairman of the Joint Chiefs of Staff, the nation’s highest-ranking military officer, and the principal military advisor to the President, Secretary of Defense, and National Security Council.\r\n\r\nPrior to becoming Chairman on April 11, 2025, General Caine was the Associate Director for Military Affairs at Central Intelligence Agency.\r\n\r\nHe has served in a wide range of operational, staff and joint assignments, primarily as an F-16 fighter pilot, weapons officer, member of the White House staff and special operations officer.\r\n\r\nGeneral Caine was commissioned in 1990 through the ROTC program at the Virginia Military Institute, and he has an MA in Air Warfare from the American Military University. He has completed a range of national security and leadership courses, including Harvard Kennedy School's course for Senior Executives in National and International Security, and the Syracuse University Maxwell School's Program on National Security.\r\n\r\nAs a Command Pilot, he has logged more than 2,800 hours in the F-16, including more than 150 combat hours. From 2009-2016, Caine was a part-time member of the National Guard and a serial entrepreneur and investor."
  },
  {
    "name": "Colonel Wesley Knight",
    "title": "C-UXS Division Chief",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Dr. Joe Register",
    "title": "Vice President of R&D",
    "company": "Aevex Aerospace",
    "bio": "Dr. Joe Register is a dynamic technical entrepreneur and engineer with two decades of experience developing cutting-edge technologies for defense and aerospace applications. His career has been defined by a relentless drive to prototype, develop, and commercialize mission-critical systems, particularly for the Department of Defense (DoD).\r\n\r\nAfter earning his B.S. in Electrical Engineering from the University of South Florida (USF) in 2008, Joe joined Lockheed Martin, where he worked on mission-critical space and defense systems, gaining deep expertise in designing and engineering complex, highly reliable technologies.\r\n\r\nHis passion for pushing technological boundaries led him to pursue a Ph.D. in Electrical Engineering at USF, focusing on Brain-Machine Interfaces and silicon carbide bioelectronics interfaces—research with significant implications for defense and military applications.\r\n\r\nIn 2016, Joe joined Draper Labs as a Senior Member of Technical Staff, overseeing projects in bioelectronics, optics, and robotics. He played a key role in developing neurostimulation devices, augmented reality displays, and next-generation defense technologies for SOCOM, frequently collaborating with DARPA and other government agencies.\r\n\r\nBy 2021, Joe co-founded Tribe Aerospace Corporation to revolutionize UAV and drone technology for military applications. Under his leadership, Tribe developed modular, mission-adaptive drone platforms, growing to nearly 200 employees before being acquired by AEVEX Aerospace in 2022.\r\n\r\nToday, Joe serves as the Vice President of R&D at AEVEX Tactical Systems, leading advancements in unmanned systems and next-generation defense technologies. His expertise spans research, prototyping, and large-scale implementation, making him a key innovator in DoD technology development."
  },
  {
    "name": "Mr. Alex Clark",
    "title": "Senior Technical Director for all Autonomy",
    "company": "BlueHalo, LLC",
    "bio": "Alex Clark is the Senior Director of Advanced Innovation at BlueHalo, where he leads strategic development across all-domain mission areas, including Counter-Uncrewed Systems (UxS), Autonomous Platforms, and Integrated Defense Technologies. With a focus on operational relevance and rapid fielding, Alex drives the transition of emerging technologies into deployable capabilities for complex threat environments.\r\n\r\nA graduate of The University of Alabama in Huntsville with degrees in mechanical and electrical enginering, Alex combines a strong engineering foundation with firsthand experience leading cross-functional teams in the development of advanced sensing, targeting, autonomy, and kinetic effect systems. His work spans domains—from CUAS and autonomous ISR to layered maritime sensing and counter-surface strategies.\r\n\r\nKnown for integrating cutting-edge solutions at the speed of relevance, Alex works closely with end-users, technologists, and acquisition leaders to ensure BlueHalo delivers disruptive capabilities across today’s multidomain battlespace."
  },
  {
    "name": "Mr. Andrew Howard",
    "title": "Vice President, Corporate Capabilities and Solutions",
    "company": "Astrion",
    "bio": "Andrew Howard is Vice President of Corporate Capabilities and Offerings at Astrion, where he works closely with the Growth organization to define and deliver differentiated solutions for government customers. He leads the Solution Architecture team, which plays a critical role in bridging innovation and execution—ensuring that Astrion’s cutting-edge technologies, including those developed through IR&D, are seamlessly integrated into capture strategies and proposal efforts.\r\n\r\nAndrew brings deep experience in delivering advanced technologies for the Department of Defense. Prior to joining Astrion, he was Senior Director of Unmanned Surface Vessel and Autonomy Programs at Huntington Ingalls Industries, where he led programs spanning small craft to 200+ foot vessels for the U.S. Navy and other government agencies.\r\n\r\nPreviously, he served as Cognitive Solutions Chief Architect at Perspecta, where he shaped the company’s approach to machine learning and artificial intelligence. He has also managed multi-million-dollar technology portfolios for national security customers at ByteCubed and ManTech International.\r\n\r\nAndrew holds an MBA from the Wharton School with a focus on strategic leadership and product development, as well as an MS in Aerospace Engineering from Georgia Tech and a BS in Aerospace Engineering from the University of Maryland."
  },
  {
    "name": "Mr. Raymond McPeek",
    "title": "C-UXS Subject Matter Expert",
    "company": "U.S. Northern Command",
    "bio": ""
  },
  {
    "name": "Mr. Austin Branch",
    "title": "",
    "company": "Information Professionals Association",
    "bio": "Austin Branch is the founder of Crescent Bridge Corporation, supporting the technical, information, and cognitive security needs of the U.S. government, commercial enterprises, and international partners. He also serves as a Visiting Professor of Practice at the University of Maryland’s Applied Research Laboratory for Intelligence & Security (ARLIS), where he contributes to applied research in information, cyber, media, and cognitive science.\r\n\r\nCommissioned as an Infantry Officer in 1986 from The Citadel, Austin became the U.S. Army’s first Information Operations Officer. Over his military career, he held key leadership roles within the Army, Joint Special Operations Command, Joint Staff, National Security Staff, and U.S. European Command, and deployed with joint and multinational task forces worldwide.\r\n\r\nAfter retiring from the Army, Austin served as Deputy Director and Chief of Operations for the Defense Policy Analysis Office within the Office of the Under Secretary of Defense for Intelligence. He was later appointed as a Senior Executive Leader, where he oversaw Defense Information Operations, policy, and special programs. In 2010, he was selected by the Secretary of Defense to lead the Department’s Information Operations and Military Information Support Enterprise.\r\n\r\nIn 2013, Austin was appointed by the Director of National Intelligence to lead a new domestic counterterrorism and cyber policy initiative in support of the National Security Council, including serving as the national co-lead for countering ISIS propaganda. He is recognized for innovative collaborations with the entertainment and gaming industries to align emerging technologies with national security objectives.\r\n\r\nAustin co-founded the Information Professionals Association (IPA), a nonprofit organization dedicated to advancing cognitive security and the global information community. He has served on the Defense Science Board and continues to advise on strategic competition in the information environment. A frequent speaker, he participates in academic and professional forums worldwide."
  },
  {
    "name": "Major General Jason C. Slider",
    "title": "Commanding General, John F. Kennedy Special Warfare Center and School, the Special Operations Center",
    "company": "U.S. Army",
    "bio": ""
  },
  {
    "name": "Mr. Kennan Hedrick",
    "title": "Principal Director, Information Operations Policy",
    "company": "Office of the Secretary of Defense (OSD) Policy",
    "bio": "Kennan F. Hedrick is the Principal Director for Information Operations Policy in the Office of the Secretary of Defense (OSD) Policy.\r\n\r\nHe supports the Executive Director in leading Department of Defense (DoD) information operations strategy and policy, coordinating adversary and capability influence guidance, leading the Strategic Information Oversight Board, and managing Military Information Support Operations policy and resources.\r\n\r\nPrior to this role, Kennan served as Director for Global Posture Policy in OSD Policy, where he was responsible for developing DoD's strategic guidance for global posture, leading policy recommendations for the Secretary on posture adjustments and supporting resources, and coordinating posture-related engagements with the interagency, Congress, and allies and partners. Kennan led the presidentially directed 2021 Global Posture Review, which reduced the deployment of high-stressed force elements in the Middle East, implemented strategic-level posture improvements in the Indo-Pacific and Europe, and informed the 2022 National Defense Strategy and the 2023 Guidance for Employment of the Force.\r\n\r\nKennan previously held positions in OSD Policy covering Iraq, Syria, Japan, and Russia, along with external assignments in the Joint Staff and U.S. Department of State. He also serves as a Foreign Area Officer in the Army Reserve and previously served as an active-duty field artillery officer in Germany and Afghanistan.\r\n\r\nKennan is a Term Member with the Council on Foreign Relations. He holds a B.A. in Peace, War, and Defense from the University of North Carolina at Chapel Hill, an M.A. in International Affairs from The George Washington University, and an M.A. in National Security Strategy from the National War College."
  },
  {
    "name": "Captain Donald Wetherbee",
    "title": "Vice Deputy Director, Global Operations",
    "company": "Joint Staff, J39",
    "bio": "Captain Don Wetherbee graduated from the U.S. Naval Academy in 1997 and completed a Master’s degree in Joint Campaign Planning and Strategy at the Joint Advanced Warfighting School (JAWS).\r\n\r\nHis command tours include SEAL Team FOUR, Special Operations Task Force – East Africa, Naval Special Warfare Development Group – Technical Support Squadron, Joint Special Operations Task Force – Somalia, and Naval Special Warfare Group TWO. He also commanded the Joint Force Special Operations Component Command (JFSOCC) during the withdrawal from Somalia.\r\n\r\nHis operational tours include USS Ford, MCM Rotational Crew Foxtrot (USS Gladiator and USS Dextrous), SEAL Team TWO/EIGHT (Platoon and Troop Commander, Operations Officer, Executive Officer), and NSW Group TWO (Operations Officer, Chief of Staff).\r\n\r\nHis staff assignments include Deputy J39 on the Joint Staff, Director of the Joint Information Operations Warfare Center, J5 for Special Operations Joint Task Force – Afghanistan, C5 for NATO Special Operations Component Command – Afghanistan, J3 for Joint Task Force 48-4, Joint Staff J3 Directorate for Special Operations as the PACOM/EUCOM/AFRICOM Branch Chief, and Deputy Executive Assistant to the Commander, U.S. Fleet Forces Command.\r\n\r\nCaptain Wetherbee is married to Tamara, and they have three children: Hal (21), Sydney (18), and Alexandra (16)."
  },
  {
    "name": "Dr. Todd Helmus",
    "title": "Senior Behavioral Scientist; Professor of Policy Analysis",
    "company": "RAND School of Public Policy",
    "bio": "Todd Helmus is a senior behavioral scientist at RAND and a professor of policy analysis at the RAND School of Public Policy.  He is nationally recognized expert on irregular warfare, terrorism, and information operations. Helmus has studied approaches to counter a variety of irregular threats to the U.S. to include foreign terrorist recruitment and propaganda, Chinese maritime gray zone tactics, and adversary propaganda campaigns and deepfakes.\r\n\r\nIn addition to his research, Todd has served as a deployed analyst to U.S. military commands in Iraq and Afghanistan, he teaches graduate level courses on information operations and serves as a frequent speaker at security and online safety conferences.\r\n\r\nHelmus holds a Ph.D. in clinical psychology from Wayne State University, Detroit, MI."
  },
  {
    "name": "Mr. Brian Murphy",
    "title": "President",
    "company": "Information Professionals Association",
    "bio": "Brian Murphy is an Associate Managing Director at Kroll Associates’ Data and Cyber Security division. In this role, he assists federal and private sector clients in designing, implementing, and modifying end-to-end cyber solutions.\r\n\r\nPrior to Kroll, Murphy was the Managing Director for Logically.ai. There, he assisted in developing and implementing advanced Machine Learning and Artificial Intelligence solutions to find harmful threat content at scale and across languages and internet platforms.\r\n\r\nBefore joining Logically, Murphy served as both the Principal and Acting Under Secretary for Intelligence at the Department of Homeland Security (DHS). Murphy was a special agent with the FBI for 20 years. While there, he performed duties ranging from street agent to national manager in the Senior Executive Service. During his career, he served in New York, Afghanistan, Algeria, Tunisia, Niger, Pittsburgh, Chicago, and Washington, DC.\r\n\r\nMurphy began his federal service in 1994 as an officer in the U.S. Marine Corps and later returned to active duty in 2004 to serve in Iraq.\r\n\r\nMurphy has been an adjunct professor in Georgetown’s Security Studies Program, where he teaches homeland security and the domestic intelligence architecture underpinning national security.\r\n\r\nAs of 2022, Murphy has been a member of DHS’s Election Infrastructure Committee, and in 2024 was elected to its executive committee. In 2023, he joined Pitt Cyber as an Affiliate Practice Scholar, where he collaborates with researchers and industry professionals.\r\n\r\nMurphy is also the President of the non-profit Information Professionals Association, which is focused on cognitive security.\r\n\r\nHis academic credentials include a PhD from Georgetown University, an MA from Columbia University, and a BA from William & Mary. He is a certified U.S. Intelligence Officer, Joint Duty Certified, and maintains a Top Secret clearance. Murphy is the author of several books and peer-reviewed journal articles."
  },
  {
    "name": "Colonel Antonio di Leonardo",
    "title": "Commander, PSYOPS Regiment",
    "company": "Italian Army",
    "bio": "Colonel Antonio DI LEONARDO enrolled in the Italian Army in 1995, joining the Army Academy. Successive postings have taken his from the 5th Anti-aircraft Artillery to the 28th Army PSYOPS Regiment, notably to undertake a range of Command and staff duties such as those of Army Antiaircraft Company, Tactical Air Defense Control Officer, PSYOPS Company Commander, Operations at the PSYOPS Regiment, General Planning Staff Officer and Doctrine Officer at the Army HQ, PSYOPS Battalion Commander, NATO Deputy Supreme Allied Commander Transformation Executive Assistant.\r\n\r\nColonel Antonio DI LEONARDO has also performed the duties of PSYOPS Analyst at the Multinational Division \"Salamandre\" - Mission SFOR (Bosnia and Herzegovina); PSYOPS Media Analyst at the Multinational Brigade South West - Mission KFOR (Kosovo); Tactical PSYOPS Company Commander at the Multinational Command West and Operations Staff Officer - Mission ISAF (Afghanistan), Unite Nations Line Military Observer at the United Nations Truce Supervision Organization (UNTSO) in Israel and in Lebanon and UNTSO Observer Group Lebanon Chief of Operations (Lebanon).\r\n\r\nColonel Antonio DI LEONARDO has a Bachelor in Political Sciences from Turin's University, a Bachelor in International Relationship from Trieste's University and a Masters in Strategic Defense Studies from the Rome III University. He is also a graduate of the Command and Staff Course at the Army School of Application in Turin and of the Advanced Military Studies Course at the Military Joint defense College. He was awarded several NATO and UN Medals for the abovementioned services in SFOR, KFOR, ISAF, UNTSO, UNTSO OGL, UNDOF ISAF HQ. He is highly qualified in Air Defense, PSYOPS and STRATCOM.\r\n\r\nColonel Antonio DI LEONARDO was promoted to his current rank on 1 January 2021. On 7th October 2022, he was appointed to his current duty as Commander of the Italian Army PSYOPS Regiment."
  },
  {
    "name": "Lieutenant Colonel Jason Hasbrouck",
    "title": "Deputy Division Chief, Information Operations, Headquarters Air Force",
    "company": "U.S. Air Force",
    "bio": "Lt Col Jason Hasbrouck, PhD serves as the Deputy 14F Career Field Functional Manager and Deputy Chief of the Information Operations Division within the Spectrum, Information, and Cyber Effects Operations Directorate at Headquarters Air Force, the Pentagon. In this role, he shapes strategy, policy, guidance, and resource advocacy for Information Operations, including Operations Security, Military Information Support Operations (MISO), and Deception Activities in support of the Air Force’s core missions and Joint warfighting objectives.\r\n\r\nPreviously, Lt Col Hasbrouck served as Chief of MISO Policy and Assessments at U.S. Special Operations Command (USSOCOM) J39, where he led global strategic-level research and assessments of Military Information Support Operations. Over his 17-year career as an Information Operations Officer, he has held key roles in public affairs, research, and strategic communication. His assignments include leading research at Headquarters Air Force Public Affairs to shape communication strategy for the Secretary of the Air Force and conducting scientific research at the Air Force Research Laboratory during two separate tours.\r\n\r\nLt Col Hasbrouck also served as a White House Social Aide during the Obama Administration.\r\n\r\nHe holds a PhD in Social, Decision, and Organizational Psychology from the University of Maryland, College Park. His academic research focused on the psychological motivations behind terrorism and extreme violence."
  },
  {
    "name": "Colonel Alphanso Adams ​",
    "title": "Division Chief, J3 Cyber and Electronic Warfare, Directorate of Operations",
    "company": "U.S. Special Operations Command",
    "bio": "Colonel Alphanso Adams is a National Security Affairs Fellow for academic year 2023–2024 at the Hoover Institution. Previously, he was the Commander of the 561st Network Operations Squadron at Peterson Space Force Base, Colorado.\r\n\r\nColonel Adams is a career Cyberspace Operations Officer. A graduate of Baylor University in Waco, Texas, he commissioned through the Reserve Officer Training Corps in May 2004. He has led teams as a Flight Commander, Assistant Director of Operations, Branch Chief, Division Chief, and Squadron Commander.\r\n\r\nColonel Adams has also served as a strategist in the Department of the Air Force Rapid Capabilities Office, Military Liaison for then-Senator Bill Nelson of Florida during the 115th Congress, and a fellow at the Hoover Institution at Stanford University.\r\n\r\nHe and his wife, Regina, are the proud parents of three boys – Kai, Bryce, and Austin."
  },
  {
    "name": "Ms. Virginia McCabe",
    "title": "Director,",
    "company": "NATO STRATCOM PAO J10",
    "bio": "Ms. Ginny McCabe serves as the Director of J10 for Allied Special Operations Forces Command (SOFCOM), a role she has held since March 2021 following her retirement from the U.S. Army. In this position, she leads strategic communication initiatives encompassing public affairs, psychological operations, and information operations, and advises senior leadership on media engagement and outreach strategies in support of SOFCOM’s mission and NATO’s broader operational objectives.\r\n\r\nPreviously, Ms. McCabe served as the Public Affairs Officer to the Supreme Allied Commander Europe (SACEUR) and as Deputy Public Affairs Officer at Supreme Headquarters Allied Powers Europe (SHAPE). Throughout her 26-year military career, she served as a public affairs officer at all levels within the 82nd Airborne Division and in support of Operations Enduring Freedom and Iraqi Freedom.\r\n\r\nA native of Appleton, Wisconsin, Ms. McCabe commissioned into the U.S. Army in June 1995 through the Army ROTC program at the University of Wisconsin–Oshkosh. She holds a Bachelor's degree in English and Sports and Leisure Management from Marian University in Fond du Lac, Wisconsin, and a Master’s degree in Human Resource Management from Webster University."
  },
  {
    "name": "Mr. David Breede",
    "title": "Program Executive Officer for Tactical Information Systems, PEO (TIS)",
    "company": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Courtney Robinson",
    "title": "Mistress of Ceremonies",
    "company": "Anchor, 10 Tampa Bay",
    "bio": ""
  }
]